Repository: Druzai/Bot_Mc_discord
Catalog: locales/*/LC_MESSAGES/lang.po
Languages: ru

source: Do you want the bot to set server properties to offline mode (without Internet access)?
ru: Вы хотите, чтобы бот устанавливал свойства сервера в автономный режим (без доступа к Интернету)?

source: Do you want the bot to set server property 'force-gamemode' to 'true'? Y/n (forces players to join in the default game mode. Default is survival) Note: It's better to enable this option if you're using a temporary operator via bot commands
ru: Вы хотите, чтобы бот устанавливал для свойства сервера 'force-gamemode' значение 'true'? Y/n (заставляет игроков присоединяться в режиме игры по умолчанию. По умолчанию - выживание) Примечание: Лучше включить эту опцию, если вы используете временного оператора через команды бота

source: Change server name '{0}'?
ru: Изменить название сервера '{0}'?

source: Change server working directory '{0}'?
ru: Изменить рабочую директорию сервера '{0}'?

source: Change server start file name '{0}'?
ru: Изменить название файла запуска сервера '{0}'?

source: Change server's enforce offline mode?
ru: Изменить принудительный автономный режим сервера?

source: Change server's enforce default game mode?
ru: Изменить принудительный режим игры по умолчанию для сервера?

source: Enter server working directory (full path)
ru: Введите рабочую директорию сервера (полный путь)

source: There are no '*.jar' files in this working directory.
ru: В этой рабочей директории нет файлов '*.jar'.

source: This working directory is wrong.
ru: Эта рабочая директория - неправильная.

source: Bot detected your operating system is Linux. Bot will search for '*.sh' file. You need to enter file name {0}without{1} file extension!
ru: Бот обнаружил, что ваша операционная система - Linux. Бот будет искать файл '*.sh'. Вам необходимо ввести имя файла {0}без{1} расширения файла!

source: Bot detected your operating system is Windows. Bot will search for '*.bat' file, '*.cmd' file or shortcut. You need to enter file name {0}without{1} file extension!
ru: Бот обнаружил, что ваша операционная система - Windows. Бот будет искать файл '*.bat', '*.cmd' или ярлык. Вам необходимо ввести имя файла {0}без{1} расширения файла!

source: Bot detected your operating system is macOS. Bot will search for '*.command' or '*.sh' file. You need to enter file name {0}without{1} file extension!
ru: Бот обнаружил, что ваша операционная система - macOS. Бот будет искать файл '*.command' или '*.sh'. Вам необходимо ввести имя файла {0}без{1} расширения файла!

source: Bot couldn't detect your operating system. You need to enter file name {0}with{1} file extension!
ru: Бот не смог обнаружить вашу операционную систему. Вам необходимо ввести имя файла {0}с{1} расширением!

source: Enter server start file name
ru: Введите имя файла для запуска сервера

source: Target of this start file shortcut '{0}' doesn't exists.
ru: Цели этого ярлыка для запуска сервера '{0}' не существует.

source: Target of this start file shortcut '{0}' isn't '*.bat' file or '*.cmd' file.
ru: Целью этого ярлыка для запуска сервера '{0}' не являются файл '*.bat' или '*.cmd'.

source: This start file doesn't exist.
ru: Этого файла для запуска сервера не существует.

source: Bot found several files that match search conditions:
ru: Бот обнаружил несколько файлов, которые соответствуют условиям поиска:

source: Type the chosen one
ru: Введите выбранный

source: Watcher's delay to refresh doesn't set.
ru: Задержка наблюдателя на обновление не установлена.

source: Note: If your machine has processor with frequency 2-2.5 GHz, you have to set this option from '0.5' to '0.9' second for the bot to work properly.
ru: Примечание. Если на вашем компьютере процессор с частотой 2–2,5 ГГц, вы должны установить для этого параметра значение от '0,5' до '0,9' секунды, чтобы бот работал правильно.

source: Set delay to refresh (in seconds, float)
ru: Установите задержку обновления (в секундах, дробное число)

source: Watcher's number of lines to check in server log doesn't set.
ru: Количество строк для проверки наблюдателем в логе сервера не установлено.

source: Set number of lines to check
ru: Установите количество строк для проверки

source: Would you like to enable game chat?
ru: Вы хотите включить игровой чат?

source: Webhook URL for game chat not found. Would you like to enter it?
ru: URL-адрес вебхука для игрового чата не найден. Вы хотите его ввести?

source: Enter webhook URL for game chat
ru: Введите URL-адрес вебхука для игрового чата

source: Bot will fetch disowned webhook or create a new one! You can change it via '{0}{1}'.
ru: Бот возьмёт ничейный вебхук или создаст новый! Вы можете изменить его с помощью '{0}{1}'.

source: Avatar URL for death messages chat not found. Would you like to enter it?
ru: URL-адрес аватара для сообщений о смерти не найден. Вы хотите его ввести?

source: Enter URL for avatar image
ru: Введите URL для изображения аватара

source: Avatar URL for death messages would be taken from bot's avatar.
ru: URL-адрес аватара для сообщений о смерти будет взят из аватара бота.

source: Enter how many words in mention from Minecraft chat bot can parse (0 - handle only mentions with one word) (default - 5, int)
ru: Введите сколько слов в упоминании из чата майнкрафта бот может разобрать (0 - обрабатывать только упоминания с одним словом) (по умолчанию - 5, целое число)

source: Enter how many characters from right side of mention bot can remove to find similar mention in Discord (0 - don't try to find similar ones) (default - 5, int)
ru: Введите сколько символов из правой части упоминания бот может удалить, чтобы найти похожее упоминание в дискорде (0 - не пытаться найти похожие) (по умолчанию - 5, целое число)

source: Would you like to enable image preview in game chat?
ru: Вы хотите включить предварительный просмотр изображения в игровом чате?

source: Enter the maximum image width that will be displayed in game chat (default - 160 pixels, int)
ru: Введите максимальную ширину изображения, которое будет отображаться в игровом чате (по умолчанию - 160 пикселей, целое число)

source: Enter the maximum image height that will be displayed in game chat (default - 30 pixels, int)
ru: Введите максимальную высоту изображения, которое будет отображаться в игровом чате (по умолчанию - 30 пикселей, целое число)

source: Would you like to enable obituary?
ru: Вы хотите включить некролог?

source: Webhook name for death messages not found. Would you like to enter it?
ru: Имя вебхука для сообщений о смерти не найдено. Вы хотите его ввести?

source: Enter webhook name for death messages
ru: Введите имя вебхука для сообщений о смерти

source: Bot will use default name for death messages! You can change it via '{0}{1}'.
ru: Бот будет использовать имя по умолчанию для сообщений о смерти! Вы можете изменить его через '{0}{1}'.

source: Avatar URL for death messages not found. Would you like to enter it?
ru: URL-адрес аватара для сообщений о смерти не найден. Вы хотите его ввести?

source: Enter avatar URL for death messages
ru: Введите URL-адрес аватара для сообщений о смерти

source: Bot will use default webhook's avatar for death messages! You can change it via '{0}{1}'.
ru: Бот будет использовать аватар вебхука по умолчанию для сообщений о смерти! Вы можете изменить его через '{0}{1}'.

source: Would you like to enable authorization security?
ru: Вы хотите включить безопасную авторизацию?

source: Would you like to enable login check? Y/n (bot will ping the server to check if the player is really logged in) Note: It's better to disable this option if you're using a modded server (forge, fabric)!
ru: Вы хотите включить проверку входа в систему? Y/n (бот будет пинговать сервер, чтобы проверить, действительно ли игрок вошел в систему) Примечание: Лучше отключить эту опцию, если вы используете моженный сервер (forge, fabric)!

source: Enter how many attempts bot will accept connection from a certain IP-address before it bans this IP
ru: Введите сколько попыток бот будет принимать соединение с определенного IP-адреса, прежде чем он забанит этот IP

source: Enter how many days IP-address will be valid before it expires (int)
ru: Введите сколько дней IP-адрес будет действителен до истечения срока его действия (целое число)

source: Enter in how many days expired IP-address will be deleted (int)
ru: Введите через сколько дней просроченный IP-адрес будет удалён (целое число)

source: Enter how many characters the code should consist of (default - 6, int)
ru: Введите количество символов, из которых должен состоять код (по умолчанию - 6, целое число)

source: Enter how many minutes code will be valid before it expires (int)
ru: Введите сколько минут код будет действителен до истечения срока его действия (целое число)

source: Secure authorization enabled.
ru: Безопасная авторизация включена.

source: Secure authorization disabled.
ru: Безопасная авторизация выключена.

source: Would you like to enable RSS?
ru: Вы хотите включить RSS?

source: Webhook URL for RSS not found. Would you like to enter it?
ru: URL-адрес вебхука RSS не найден. Вы хотите его ввести?

source: Enter webhook URL for RSS
ru: Введите URL-адрес вебхука для RSS

source: URL of RSS feed not found. Would you like to enter it?
ru: URL-адрес для RSS не найден. Вы хотите его ввести?

source: Enter URL of RSS feed
ru: Введите URL-адрес RSS-канала

source: RSS wouldn't work. Enter URL of RSS feed to bot config!
ru: RSS не будет работать. Введите URL-адрес для RSS в конфиге бота!

source: Enter scan interval for RSS feed (in seconds, int)
ru: Введите интервал сканирования для RSS-канала (в секундах, целое число)

source: Enable using spoofed user agent (Chrome or Firefox) instead of default one (indicating the sender is a bot) for RSS feed check requests?
ru: Включить использование поддельного пользовательского агента (Chrome или Firefox) вместо стандартного (указывающего на то, что отправитель - бот) для запросов на проверку RSS-канала?

source: Automatic backup isn't set. Would you like to enable them?
ru: Автоматическое резервное копирование не установлено. Вы хотите включить его?

source: Set period of automatic backups (in minutes, int)
ru: Установите период автоматического резервного копирования (в минутах, целое число)

source: Enter name of the backups folder for each Minecraft server
ru: Введите имя папки резервных копий для каждого майнкрафт сервера

source: The maximum backups' count limit for server not found. Would you like to set it?
ru: Максимальный предел количества резервных копий для сервера не найден. Вы хотите его установить?

source: Set maximum backups' count limit for server (int)
ru: Максимальный предел количества резервных копий для сервера (целое число)

source: Backups' size limit for server not found. Would you like to set it?
ru: Предел размера резервных копий для сервера не найден. Вы хотите его установить?

source: Enter in what unit of measure you will set the limit
ru: Введите в каких единицах измерения вы установите предел

source: You have entered the wrong unit of measure!
ru: Вы ввели неверную единицу измерения!

source: Backups' size limit for server in {0} (int)
ru: Предел размера резервных копий для сервера в {0} (целое число)

source: Name of the backups folder in which bot will store them - '{0}'.
ru: Имя папки резервных копий, в которой бот будет их сохранять - '{0}'.
