Repository: Druzai/Bot_Mc_discord
Catalog: locales/*/LC_MESSAGES/lang.po
Languages: ru

source: Bot doesn't have this command line argument!
ru: Бот не имеет такого аргумента командной строки!

source: bot_help
ru: Бот для майнкрафт сервера Аргументы: -h, --help Печатает это сообщение и выходит. -v, --version Печатает версию бота и выходит. -cs Для изменения майнкрафт серверов в конфиге бота.

source: Bot started!
ru: Бот запустился!

source: Server info read!
ru: Информация о сервере прочтена!

source: Bot/Discord Error: Your token is wrong
ru: Ошибка бота/дискорда: Ваш токен не правильный

source: Bot Error: {0}
ru: Ошибка бота: {0}

source: Bot/Discord Error: Something went wrong ( ͡° ͜ʖ ͡°)
ru: Ошибка бота/дискорда: Что-то пошло не так ( ͡° ͜ʖ ͡°)

source: Press any key to continue...
ru: Для продолжения нажмите любую клавишу...

source: Bot is stopping...
ru: Бот останавливается...

source: en
ru: Английский

source: ru
ru: Русский

source: B
ru: Б

source: KB
ru: КБ

source: MB
ru: МБ

source: GB
ru: ГБ

source: TB
ru: ТБ

source: PB
ru: ПБ

source: {0} was obliterated by a sonically-charged shriek whilst trying to escape {1} wielding {2}
ru: {0} был уничтожен звуковым зарядом, спасаясь от {1}, держащего {2}

source: {0} was obliterated by a sonically-charged shriek while trying to escape {1} wielding {2}
ru: {0} был уничтожен звуковым зарядом, спасаясь от {1}, держащего {2}

source: {0} was obliterated by a sonically-charged shriek whilst trying to escape {1}
ru: {0} был уничтожен звуковым зарядом, спасаясь от {1}

source: {0} was obliterated by a sonically-charged shriek while trying to escape {1}
ru: {0} был уничтожен звуковым зарядом, спасаясь от {1}

source: {0} was poked to death by a sweet berry bush whilst trying to escape {1}
ru: {0} искололся до смерти в кустах сладких ягод, спасаясь от {1}

source: {0} was poked to death by a sweet berry bush while trying to escape {1}
ru: {0} искололся до смерти в кустах сладких ягод, спасаясь от {1}

source: {0} went off with a bang due to a firework fired from {2} by {1}
ru: {0} с треском разлетелся из-за фейерверка {1}, выпущенного из {2}

source: {0} was skewered by a falling stalactite whilst fighting {1}
ru: {0} был пронзён обрушившимся сталактитом, пока боролся с {1}

source: {0} was skewered by a falling stalactite while fighting {1}
ru: {0} был пронзён обрушившимся сталактитом, пока боролся с {1}

source: {0} experienced kinetic energy whilst trying to escape {1}
ru: {0} преобразовал кинетическую энергию во внутреннюю, спасаясь от {1}

source: {0} experienced kinetic energy while trying to escape {1}
ru: {0} преобразовал кинетическую энергию во внутреннюю, спасаясь от {1}

source: {0} was burned to a crisp while fighting {1} wielding {2}
ru: {0} был сожжён дотла, пока боролся с {1}, держащим {2}

source: {0} was burnt to a crisp whilst fighting {1} wielding {2}
ru: {0} был сожжён дотла, пока боролся с {1}, держащим {2}

source: {0} was squashed by a falling anvil whilst fighting {1}
ru: {0} был раздавлен упавшей наковальней, пока боролся с {1}

source: {0} hit the ground too hard whilst trying to escape {1}
ru: {0} разбился вдребезги, спасаясь от {1}

source: {0} was squashed by a falling block whilst fighting {1}
ru: {0} был раздавлен упавшим блоком, пока боролся с {1}

source: {0} left the confines of this world whilst fighting {1}
ru: {0} покинул пределы этого мира, пока боролся с {1}

source: {0} was squashed by a falling anvil while fighting {1}
ru: {0} был раздавлен упавшей наковальней, пока боролся с {1}

source: {0} hit the ground too hard while trying to escape {1}
ru: {0} разбился вдребезги, спасаясь от {1}

source: {0} was squashed by a falling block while fighting {1}
ru: {0} был раздавлен упавшим блоком, пока боролся с {1}

source: {0} left the confines of this world while fighting {1}
ru: {0} покинул пределы этого мира, пока боролся с {1}

source: {0} was fell too far and was finished by {1} using {2}
ru: {0} упал с высоты и был добит {1} с помощью {2}

source: {0} died from dehydration whilst trying to escape {1}
ru: {0} умер от обезвоживания, спасаясь от {1}

source: {0} died from dehydration while trying to escape {1}
ru: {0} умер от обезвоживания, спасаясь от {1}

source: {0} walked into a cactus whilst trying to escape {1}
ru: {0} наткнулся на кактус, спасаясь от {1}

source: {0} walked into a cactus while trying to escape {1}
ru: {0} наткнулся на кактус, спасаясь от {1}

source: {0} was killed by magic whilst trying to escape {1}
ru: {0} был убит магией, убегая от {1}

source: {0} was impaled on a stalagmite whilst fighting {1}
ru: {0} был пронзён сталагмитом, пока боролся с {1}

source: {0} was killed by magic while trying to escape {1}
ru: {0} был убит магией, убегая от {1}

source: {0} was impaled on a stalagmite while fighting {1}
ru: {0} был пронзён сталагмитом, пока боролся с {1}

source: {0} fell too far and was finished by {1} using {2}
ru: {0} упал с высоты и был добит {1} с помощью {2}

source: {0} was obliterated by a sonically-charged shriek
ru: {0} был уничтожен звуковым зарядом

source: {0} didn't want to live in the same world as {1}
ru: {0} не захотел жить в том же мире, что и {1}

source: {0} was struck by lightning whilst fighting {1}
ru: {0} был поражён молнией, пока боролся с {1}

source: {0} was struck by lightning while fighting {1}
ru: {0} был поражён молнией, пока боролся с {1}

source: {0} was killed by {2} while trying to hurt {1}
ru: {0} был убит {2}, пытаясь навредить {1}

source: {0} was burned to a crisp while fighting {1}
ru: {0} был сожжён дотла, пока боролся с {1}

source: {0} was poked to death by a sweet berry bush
ru: {0} искололся до смерти в кустах сладких ягод

source: {0} was fell too far and was finished by {1}
ru: {0} упал с высоты и был добит {1}

source: {0} went off with a bang whilst fighting {1}
ru: {0} с треском разлетелся, пока боролся с {1}

source: {0} suffocated in a wall whilst fighting {1}
ru: {0} был погребён заживо, пока боролся с {1}

source: {0} was burnt to a crisp whilst fighting {1}
ru: {0} был сожжён дотла, пока боролся с {1}

source: {0} went off with a bang while fighting {1}
ru: {0} с треском разлетелся, пока боролся с {1}

source: {0} suffocated in a wall while fighting {1}
ru: {0} был погребён заживо, пока боролся с {1}

source: {0} walked into the danger zone due to {1}
ru: {0} зашёл в опасную зону из-за {1}

source: {0} was shot by a skull from {1} using {2}
ru: {0} был поражён черепом из {1} с помощью {2}

source: {0} was roasted in dragon's breath by {1}
ru: {0} сварился заживо в драконьем дыхании из-за {1}

source: {0} was skewered by a falling stalactite
ru: {0} был пронзён обрушившимся сталактитом

source: {0} fell too far and was finished by {1}
ru: {0} упал с высоты и был добит {1}

source: {0} walked into fire whilst fighting {1}
ru: {0} сгорел в огне, пока боролся с {1}

source: {0} starved to death whilst fighting {1}
ru: {0} умер от голода, пока боролся с {1}

source: {0} was killed by {2} trying to hurt {1}
ru: {0} был убит {2}, пытаясь навредить {1}

source: {0} walked into fire while fighting {1}
ru: {0} сгорел в огне, пока боролся с {1}

source: {0} tried to swim in lava to escape {1}
ru: {0} упал в лаву, убегая от {1}

source: {0} starved to death while fighting {1}
ru: {0} умер от голода, пока боролся с {1}

source: {0} was stung to death by {1} using {2}
ru: {0} был изжален до смерти {1} с помощью {2}

source: {0} was killed while trying to hurt {1}
ru: {0} был убит, пытаясь навредить {1}

source: {0} was doomed to fall by {1} using {2}
ru: {0} был обречён на падение {1} с помощью {2}

source: {0} was roasted in dragon breath by {1}
ru: {0} сварился заживо в драконьем дыхании из-за {1}

source: {0} drowned whilst trying to escape {1}
ru: {0} утонул, спасаясь от {1}

source: {0} drowned while trying to escape {1}
ru: {0} утонул, спасаясь от {1}

source: {0} walked into danger zone due to {1}
ru: {0} зашёл в опасную зону из-за {1}

source: {0} withered away whilst fighting {1}
ru: {0} был иссушён, пока боролся с {1}

source: {0} withered away while fighting {1}
ru: {0} был иссушён, пока боролся с {1}

source: {0} was squashed by a falling anvil
ru: {0} раздавлен упавшей наковальней

source: {0} was squashed by a falling block
ru: {0} раздавлен упавшим блоком

source: {0} was fireballed by {1} using {2}
ru: {0} убит файерболом {1} с помощью {2}

source: {0} left the confines of this world
ru: {0} покинул пределы этого мира

source: {0} was roasted in dragon's breath
ru: {0} испепелён дыханием дракона

source: {0} was killed whilst fighting {1}
ru: {0} был убит, сражаясь с {1}

source: {0} was killed by even more magic
ru: {0} был убит неизведанной магией

source: {0} was blown up by {1} using {2}
ru: {0} был взорван {1} с помощью {2}

source: {0} was killed while fighting {1}
ru: {0} был убит, сражаясь с {1}

source: {0} discovered the floor was lava
ru: {0} обнаружил, что пол — это лава

source: {0} was killed by {1} using magic
ru: {0} был убит {1} с помощью магии

source: {0} was pummeled by {1} using {2}
ru: {0} был избит {1} с помощью {2}

source: {0} was killed trying to hurt {1}
ru: {0} был убит, пытаясь навредить {1}

source: {0} was shot by a skull from {1}
ru: {0} был поражён черепом из {1}

source: {0} fell off some twisting vines
ru: {0} сорвался с вьющейся лозы

source: {0} was roasted in dragon breath
ru: {0} растворился в драконьем дыхании

source: {0} was killed by {1} using {2}
ru: {0} был убит {1} с помощью {2}

source: {0} was smashed by {1} with {2}
ru: {0} был сокрушён {1} с помощью {2}

source: {0} was impaled on a stalagmite
ru: {0} пронзён сталагмитом

source: {0} was impaled by {1} with {2}
ru: {0} пронзён {1} с помощью {2}

source: {0} fell off some weeping vines
ru: {0} сорвался с плакучей лозы

source: {0} experienced kinetic energy
ru: {0} преобразовал кинетическую энергию во внутреннюю

source: {0} was frozen to death by {1}
ru: {0} замёрз насмерть благодаря {1}

source: {0} was slain by {1} using {2}
ru: {0} был убит {1} с помощью {2}

source: {0} was shot by {1} using {2}
ru: {0} застрелен {1} с помощью {2}

source: {0} was stung to death by {1}
ru: {0} изжален до смерти {1}

source: {0} was doomed to fall by {1}
ru: {0} свалился благодаря {1}

source: {0} was shot by a {1}'s skull
ru: {0} был поражён черепом {1}

source: {0} hit the ground too hard
ru: {0} разбился вдребезги

source: {0} was struck by lightning
ru: {0} был поражён молнией

source: {0} fell from a high place
ru: {0} разбился насмерть

source: {0} was squished too much
ru: {0} расплющен в лепёшку

source: {0} died from dehydration
ru: {0} умер от обезвоживания

source: {0} was fireballed by {1}
ru: {0} убит файерболом {1}

source: {0} tried to swim in lava
ru: {0} решил поплавать в лаве

source: {0} fell out of the world
ru: {0} выпал из мира

source: {0} fell out of the water
ru: {0} выпал из воды

source: {0} was pricked to death
ru: {0} исколот до смерти

source: {0} went off with a bang
ru: {0} с треском разлетелся

source: {0} suffocated in a wall
ru: {0} погребён заживо

source: {0} fell off scaffolding
ru: {0} сорвался с подмосток

source: {0} was squashed by {1}
ru: {0} расплющен {1}

source: {0} was blown up by {1}
ru: {0} был взорван {1}

source: {0} died because of {1}
ru: {0} умер из-за {1}

source: {0} was killed by magic
ru: {0} был убит магией

source: {0} was pummeled by {1}
ru: {0} был избит {1}

source: {0} fell while climbing
ru: {0} сорвался

source: {0} fell off some vines
ru: {0} сорвался с лианы

source: {0} was smashed by {1}
ru: {0} был сокрушён {1}

source: {0} was stung to death
ru: {0} изжален до смерти

source: {0} was impaled by {1}
ru: {0} был пронзён {1}

source: {0} was doomed to fall
ru: {0} был обречён на падение

source: {0} was killed by {1}
ru: {0} стал жертвой {1}

source: {0} went up in flames
ru: {0} умер в огне

source: {0} fell off a ladder
ru: {0} свалился с лестницы

source: {0} was slain by {1}
ru: {0} был убит {1}

source: {0} starved to death
ru: {0} умер от голода

source: {0} was shot by {1}
ru: {0} застрелен {1}

source: {0} burned to death
ru: {0} сгорел заживо

source: {0} froze to death
ru: {0} замёрз насмерть

source: {0} withered away
ru: {0} иссушён

source: {0} was killed
ru: {0} убит

source: {0} drowned
ru: {0} утонул

source: {0} blew up
ru: {0} взорвался

source: {0} died
ru: {0} умер

source: [Intentional Game Design]
ru: [жестоких правил игры]

source: Allay
ru: Тихоня

source: Area Effect Cloud
ru: Облако эффекта

source: Armadillo
ru: Броненосец

source: Armor Stand
ru: Стойка для брони

source: Arrow
ru: Стрела

source: Axolotl
ru: Аксолотль

source: Bat
ru: Летучая мышь

source: Bee
ru: Пчела

source: Blaze
ru: Всполох

source: Bogged
ru: Болотник

source: Breeze
ru: Вихрь

source: Camel
ru: Верблюд

source: Cat
ru: Кошка

source: Cave Spider
ru: Пещерный паук

source: Minecart with Chest
ru: Грузовая вагонетка

source: Chicken
ru: Курица

source: Cod
ru: Треска

source: Minecart with Command Block
ru: Вагонетка с командным блоком

source: Cow
ru: Корова

source: Creaking
ru: Скрипун

source: Creeper
ru: Крипер

source: Dolphin
ru: Дельфин

source: Donkey
ru: Осёл

source: Dragon Fireball
ru: Файербол дракона

source: Drowned
ru: Утопленник

source: Thrown Egg
ru: Брошенное яйцо

source: Elder Guardian
ru: Древний страж

source: End Crystal
ru: Кристалл Энда

source: Ender Dragon
ru: Эндер-дракон

source: Thrown Ender Pearl
ru: Брошенный эндер-жемчуг

source: Enderman
ru: Эндермен

source: Endermite
ru: Эндермит

source: Evoker
ru: Заклинатель

source: Thrown Bottle o' Enchanting
ru: Брошенный пузырёк опыта

source: Experience Orb
ru: Сфера опыта

source: Fireball
ru: Файербол

source: Firework Rocket
ru: Фейерверк

source: Fox
ru: Лисица

source: Frog
ru: Лягушка

source: Minecart with Furnace
ru: Самоходная вагонетка

source: Ghast
ru: Гаст

source: Giant
ru: Гигант

source: Glow Squid
ru: Светящийся спрут

source: Goat
ru: Коза

source: Guardian
ru: Страж

source: Hoglin
ru: Хоглин

source: Minecart with Hopper
ru: Загрузочная вагонетка

source: Horse
ru: Лошадь

source: Husk
ru: Кадавр

source: Illusioner
ru: Иллюзор

source: Iron Golem
ru: Железный голем

source: The Killer Bunny
ru: Кролик-убийца

source: Lightning Bolt
ru: Молния

source: Llama
ru: Лама

source: Magma Cube
ru: Магмовый куб

source: Minecart
ru: Вагонетка

source: Mooshroom
ru: Муушрум

source: Mule
ru: Мул

source: Ocelot
ru: Оцелот

source: Ominous Item Spawner
ru: Зловещий рассадник предметов

source: Panda
ru: Панда

source: Parrot
ru: Попугай

source: Phantom
ru: Фантом

source: Pig
ru: Свинья

source: Piglin
ru: Пиглин

source: Piglin Brute
ru: Брутальный пиглин

source: Pillager
ru: Разбойник

source: Polar Bear
ru: Белый медведь

source: Pufferfish
ru: Иглобрюх

source: Rabbit
ru: Кролик

source: Ravager
ru: Разоритель

source: Salmon
ru: Лосось

source: Sheep
ru: Овца

source: Shulker
ru: Шалкер

source: Silverfish
ru: Чешуйница

source: Skeleton
ru: Скелет

source: Skeleton Horse
ru: Лошадь-скелет

source: Slime
ru: Слизень

source: Small Fireball
ru: Малый файербол

source: Sniffer
ru: Нюхач

source: Snow Golem
ru: Снежный голем

source: Snowball
ru: Снежок

source: Minecart with Monster Spawner
ru: Вагонетка с рассадником монстров

source: Spectral Arrow
ru: Спектральная стрела

source: Spider
ru: Паук

source: Squid
ru: Спрут

source: Stray
ru: Зимогор

source: Strider
ru: Лавомерка

source: Tadpole
ru: Головастик

source: Primed TNT
ru: Активированный динамит

source: Minecart with TNT
ru: Вагонетка с динамитом

source: Trader Llama
ru: Лама торговца

source: Trident
ru: Трезубец

source: Tropical Fish
ru: Тропическая рыба

source: Anemone
ru: Амфиприон

source: Black Tang
ru: Чёрная зебрасома

source: Blue Tang
ru: Голубой хирург

source: Butterflyfish
ru: Рыба-бабочка

source: Cichlid
ru: Цихлида

source: Clownfish
ru: Рыба-клоун

source: Cotton Candy Betta
ru: Сиамский петушок

source: Dottyback
ru: Грамма двухцветная

source: Emperor Red Snapper
ru: Трёхполосый луциан

source: Goatfish
ru: Барабуля

source: Moorish Idol
ru: Мавританский идол

source: Ornate Butterflyfish
ru: Разукрашенная бабочка

source: Parrotfish
ru: Рыба-попугай

source: Queen Angelfish
ru: Ангел-королева

source: Red Cichlid
ru: Красная цихлида

source: Red Lipped Blenny
ru: Красногубая морская собачка

source: Red Snapper
ru: Берикс

source: Threadfin
ru: Пальцепёр

source: Tomato Clownfish
ru: Клоун томатный

source: Triggerfish
ru: Спинорог

source: Yellowtail Parrotfish
ru: Желтохвостая рыба-попугай

source: Yellow Tang
ru: Зебрасома жёлтая

source: Betty
ru: Петушок

source: Blockfish
ru: Блокунь

source: Brinely
ru: Красотка

source: Clayfish
ru: Глинянка

source: Dasher
ru: Живец

source: Flopper
ru: Плескун

source: Glitter
ru: Блестянка

source: Kob
ru: Горбыль

source: Snooper
ru: Сыщик

source: Spotty
ru: Пеструшка

source: Stripey
ru: Полосатка

source: Sunstreak
ru: Лучехвостка

source: Turtle
ru: Черепаха

source: Vex
ru: Вредина

source: Villager
ru: Крестьянин

source: Armorer
ru: Бронник

source: Butcher
ru: Мясник

source: Cartographer
ru: Картограф

source: Cleric
ru: Священник

source: Farmer
ru: Фермер

source: Fisherman
ru: Рыбак

source: Fletcher
ru: Лучник

source: Leatherworker
ru: Кожевник

source: Librarian
ru: Библиотекарь

source: Mason
ru: Каменщик

source: Nitwit
ru: Деревенщина

source: Shepherd
ru: Пастух

source: Toolsmith
ru: Инструментальщик

source: Weaponsmith
ru: Оружейник

source: Vindicator
ru: Поборник

source: Wandering Trader
ru: Странствующий торговец

source: Warden
ru: Хранитель

source: Witch
ru: Ведьма

source: Wither
ru: Визер

source: Wither Skeleton
ru: Визер-скелет

source: Wither Skull
ru: Череп визера

source: Wolf
ru: Волк

source: Zoglin
ru: Зоглин

source: Zombie
ru: Зомби

source: Zombie Horse
ru: Лошадь-зомби

source: Zombie Villager
ru: Крестьянин-зомби

source: Zombified Piglin
ru: Зомбифицированный пиглин

source: Zombie Pigman
ru: Свинозомби

source: Minecart with Spawner
ru: Вагонетка с рассадником

source: help_brief_associate
ru: Управляет ссылками из дискорда в майнкрафт

source: help_associate
ru: Возвращает информацию о связанных никах майнкрафта Требует ссылок, которые создаёт команда '{prefix}associate add'!

source: help_associate_for_who
ru: Получить информацию о своих никах - 'me' Или получить информацию обо всех никах - 'everyone'

source: help_associate_add
ru: **Только для админа!** Связывает пользователя в дискорде с ником в майнкрафте Для более корректной работы других команд это лучше настроить!

source: help_associate_add_discord_mention
ru: Упоминание пользователя в дискорде, пример: '@Пользователь'

source: help_associate_add_minecraft_nick
ru: Ник в майнкрафте, который вы хотите связать

source: help_associate_remove
ru: **Только для админа!** Удаляет связь пользователя в дискорде с ником в майнкрафте

source: help_associate_remove_discord_mention
ru: Упоминание пользователя в дискорде, пример: '@Пользователь'

source: help_associate_remove_minecraft_nick
ru: Ник в майнкрафте, который вы хотите отвязать

source: help_brief_authorize
ru: Обеспечивает безопасную авторизацию в майнкрафте 🔑

source: help_authorize
ru: Возвращает информацию о конфигурации безопасной авторизации и авторизованных игроках

source: help_authorize_ban
ru: Банит указанный IP-адрес

source: help_authorize_ban_ip
ru: IP-адрес для поиска

source: help_authorize_ban_reason
ru: Причина для бана

source: help_authorize_banlist
ru: Возвращает список банов по IP-адресу на выбранном майнкрафт сервере

source: help_authorize_login
ru: Подтверждает и даёт доступ пользователю по нику с помощью кода Работает только если пользователь хотя бы один раз заходил на майнкрафт сервер

source: help_authorize_login_code
ru: {code_length}-значный код без учёта регистра

source: help_authorize_login_nick
ru: Ник игрока в майнкрафте Примечание: если в нике есть пробелы, вы должны ввести его в кавычках, например: "Ник"

source: help_authorize_off
ru: **Только для админа!** Отключает безопасную авторизацию

source: help_authorize_on
ru: **Только для админа!** Включает безопасную авторизацию

source: help_authorize_revoke
ru: Досрочно отзывает разрешение на доступ по IP-адресу для доступных Вам ников в майнкрафте

source: help_authorize_revoke_ip
ru: IP-адрес для поиска

source: help_authorize_revoke_nick
ru: Ник в майнкрафте для поиска Если предоставлен, только IP-адрес у этого ника, будет отозван!

source: help_authorize_revoke_all
ru: **Только для админа!** Отзывает все зашедшие ники

source: help_authorize_unban
ru: **Только для админа!** Разбанивает IP-адрес c указанным аргументом Без аргументов возвращает выпадающее меню со списком забаненных IP-адресов из выбранного списка банов сервера Майнкрафт для разбана

source: help_authorize_unban_ip
ru: IP-адрес для разбана

source: help_brief_backup
ru: Создаёт/управляет резервными копиями 💾

source: help_backup
ru: Возвращает информацию о резервных копиях

source: help_backup_force
ru: Заставляет бота создать пользовательскую резервную копию

source: help_backup_force_reason
ru: Причина для пользовательской резервной копии

source: help_backup_list
ru: Возвращает список текущих резервных копий для выбранного майнкрафт сервера

source: help_backup_method
ru: Устанавливает предоставленный метод сжатия

source: help_backup_method_compression_method
ru: Метод сжатия из '{prefix}backup method list'

source: help_backup_method_list
ru: Возвращает список поддерживаемых методов STORED - просто копирует без сжатия (самый быстрый) DEFLATED - сжимает со средним уровнем сжатия (оптимальный) BZIP2 - сжимает с высоким уровнем сжатия (медленный) LZMA - сжимает с самым высоким уровнем сжатия (самый эффективный, но медленный)

source: help_backup_off
ru: Выключает автоматическое резервное копирование

source: help_backup_on
ru: Включает автоматическое резервное копирование

source: help_backup_period
ru: Устанавливает новый период автоматического резервного копирования в минутах

source: help_backup_period_minutes
ru: Период автоматического резервного копирования в минутах

source: help_backup_remove
ru: Удаляет резервную копию для выбранного майнкрафт сервера Возвращает выпадающее меню со списком текущих резервных копий для выбранного майнкрафт сервера для удаления Может создать опрос, чтобы подтвердить ваши намерения

source: help_backup_remove_all
ru: Удаляет все резервные копии для выбранного майнкрафт сервера Создаёт опрос, чтобы подтвердить ваши намерения

source: help_backup_restore
ru: Восстанавливает резервную копию для выбранного майнкрафт сервера Возвращает выпадающее меню со списком текущих резервных копий для выбранного майнкрафт сервера для восстановления

source: help_brief_channel
ru: Управляет текстовыми каналами для некоторых функций бота

source: help_channel
ru: Управляет текстовыми каналами для некоторых функций бота Без подкоманд возвращает информацию о связанных каналах

source: help_channel_commands
ru: Сохраняет текстовый канал как канал для команд Без аргументов сохраняет текстовый канал, из которого была вызвана команда

source: help_channel_commands_channel
ru: Упоминание канала, типа '#канал' или id канала, если вы разработчик

source: help_brief_chat
ru: Управляет настройками для игрового чата

source: help_chat
ru: Управляет настройками для игрового чата Возвращает информацию о настройках игрового чата

source: help_chat_edit
ru: Изменяет сообщение (если его отправили вы) в игровом чате Авторство определяется по связям (ник в майнкрафте - пользователь в дискорде), заданным через '{prefix}associate add'! Если команда отправляется в ответ на сообщение, бот отредактирует это сообщение, в противном случае бот попытается найти последнее ваше сообщение, и отредактировать его

source: help_chat_edit_edited_message
ru: Новое содержимое отредактированного сообщения

source: help_chat_images
ru: Управляет настройками изображения при предварительном просмотре в игровом чате Возвращает информацию о настройках предварительного просмотра изображения
