Repository: Druzai/Bot_Mc_discord
Catalog: locales/*/LC_MESSAGES/lang.po
Languages: ru

source: help_chat_images_height
ru: Обновляет максимальную высоту изображения, которое будет отображаться в игровом чате

source: help_chat_images_height_pixels
ru: Целое число пикселей

source: help_chat_images_off
ru: Отключает предварительный просмотр изображения

source: help_chat_images_on
ru: Включает предварительный просмотр изображения

source: help_chat_images_width
ru: Обновляет максимальную ширину изображения, которое будет отображаться в игровом чате

source: help_chat_images_width_pixels
ru: Целое число пикселей

source: help_chat_obituary
ru: Управляет настройками некролога для игрового чата в дискорде Возвращает информацию о настройках некролога

source: help_chat_obituary_avatar
ru: Обновляет аватар смерти для некролога Бот ищет изображение либо по URL-адресу, либо во вложениях сообщения

source: help_chat_obituary_avatar_avatar_url
ru: URL-адрес для поиска

source: help_chat_obituary_name
ru: Обновляет имя для некролога

source: help_chat_obituary_name_name
ru: Новое имя для некролога

source: help_chat_obituary_name_clear
ru: Сбрасывает имя для некролога на стандартное

source: help_chat_obituary_off
ru: Отключает некролог

source: help_chat_obituary_on
ru: Включает некролог

source: help_chat_off
ru: **Только для админа!** Отключает игровой чат

source: help_chat_on
ru: **Только для админа!** Включает игровой чат

source: help_chat_webhook
ru: Управляет настройками вебхука игрового чата Возвращает информацию о настройках для этого вебхука

source: help_chat_webhook_avatar
ru: Обновлен аватар для вебхука игрового чата Бот ищет изображение либо по URL-адресу, либо во вложениях сообщения

source: help_chat_webhook_avatar_avatar_url
ru: URL-адрес для поиска

source: help_chat_webhook_channel
ru: Обновляет канал по умолчанию для вебхука игрового чата

source: help_chat_webhook_channel_channel
ru: Упоминание канала, типа '#канал' или id канала, если вы разработчик

source: help_chat_webhook_name
ru: Обновляет имя вебхука игрового чата

source: help_chat_webhook_name_name
ru: Новое имя вебхука

source: help_chat_webhook_reload
ru: Перезагружает вебхук игрового чата для бота Если бот не может найти связанный вебхук, то он создаст новый

source: help_brief_clear
ru: Удаляет сообщения (ಠ ͜ʖಠ)︻╦╤─ ֎

source: help_clear
ru: Удаляет указанное количество сообщений Может быть опасно в плохих руках...

source: help_clear_count
ru: Если положительное - количество сообщений для удаления с низа канала Если отрицательное - количество сообщений, которое надо оставить вверху канала, а остальные удалить

source: help_clear_mentions
ru: Упоминание пользователя/роли Указывает, чьи сообщения требуется удалить (иначе удаляет без разбору)

source: help_clear_all
ru: Удаляет все сообщения в канале

source: help_clear_all_mentions
ru: Упоминание пользователя/роли Указывает, чьи сообщения требуется удалить (иначе удаляет без разбору)

source: help_clear_reply
ru: Удаляет все сообщения вплоть до ответа на сообщение (ответ на сообщение не удаляется)

source: help_clear_reply_mentions
ru: Упоминание пользователя/роли Указывает, чьи сообщения требуется удалить (иначе удаляет без разбору)

source: help_brief_help
ru: Показывает справку по команде/подкоманде (͡° ͜ʖ ͡°)

source: help_help
ru: 🥚 Вы нашли пасхалку! 🥚 Без аргументов возвращает краткий список всех команд бота Если аргумент(ы) предоставлен(ы) возвращает справку по команде или подкоманде Пример: '{prefix}help команда' или '{prefix}help команда подкоманда...'

source: help_help_commands
ru: Команда или подкоманда бота, по которой вы хотите увидеть полную справку

source: help_brief_language
ru: Управляет языками бота

source: help_language
ru: Возвращает список доступных языков бота: Двухбуквенный код языка и его полное название

source: help_language_select
ru: Меняет язык бота c указанным аргументом Без аргументов возвращает выпадающее меню со списком доступных языков бота

source: help_language_select_set_language
ru: Двухбуквенный код нового языка, который вы хотите установить из списка доступных языков бота

source: help_brief_list
ru: Возвращает информацию об игроках на сервере

source: help_list
ru: Возвращает количество игроков на сервере и их ники, если сервер онлайн

source: help_brief_menu
ru: Создаёт меню для майнкрафт сервера и бота t(^ᴗ^t)

source: help_menu
ru: Показывает доступные меню

source: help_menu_bot
ru: Создаёт меню управления ботом для команд: - {prefix}authorization on/off - {prefix}backup on/off - {prefix}whitelist on/off - {prefix}op on/off - {prefix}schedule forceload on/off - {prefix}schedule shutdown on/off - {prefix}chat on/off - {prefix}chat images on/off - {prefix}chat obituary on/off - {prefix}rss on/off - {prefix}language select

source: help_menu_server
ru: Создаёт меню управления сервером для команд: - {prefix}status - {prefix}list - {prefix}status update - {prefix}backup - {prefix}backup list - {prefix}backup force - {prefix}backup restore - {prefix}backup remove - {prefix}server - {prefix}start - {prefix}stop 10 - {prefix}restart 10

source: help_brief_op
ru: Даёт/показывает игроку оператора (͠≖ ͜ʖ͠≖)👌

source: help_op
ru: **Только для админа!** Даёт игроку оператора в майнкрафте на ограниченное время Требует ссылки, которые создаёт команда '{prefix}associate add'! Может быть опасной в плохих руках...

source: help_op_minecraft_nick
ru: Ник игрока, которому вы хотите дать оператора Примечание: если в нике есть пробелы, вы должны ввести его в кавычках, например: "Ник"

source: help_op_reasons
ru: Причины для получения оператора Только для логов, можно посмотреть через '{prefix}op history'

source: help_op_history
ru: Показывает информацию об истории получения операторов

source: help_op_history_messages_from_end
ru: Количество сообщений, отображаемых с конца истории получения операторов

source: help_op_info
ru: Возвращает информацию о связанных никах майнкрафта и их количестве оставшихся использований для получения оператора Требует ссылок, которые создаёт команда '{prefix}associate add'!

source: help_op_info_for_who
ru: Получить информацию о своих никах - 'me' Или получить информацию обо всех никах - 'everyone'

source: help_op_info_show
ru: Показать информацию о никах майнкрафта, замеченные на сервере - 'seen' Или показать информацию обо всех никах майнкрафта - 'all'

source: help_op_off
ru: **Только для админа!** Выключает получение оператора игроками майнкрафта

source: help_op_on
ru: **Только для админа!** Включает получение оператора игроками майнкрафта

source: help_op_timeout
ru: **Только для админа!** Изменяет время ожидания для оператора в майнкрафте Без аргументов показывает текущее время ожидания

source: help_op_timeout_new_value
ru: Время ожидания для оператора в майнкрафте, в секундах 0 для неограниченного времени ожидания

source: help_brief_prefix
ru: Возвращает/изменяет префикс

source: help_prefix
ru: Без аргументов возвращает текущий префикс С аргументом - меняет префикс на новый

source: help_prefix_new_prefix
ru: Новый префикс для бота

source: help_brief_restart
ru: Перезапускает сервер

source: help_restart
ru: Перезапускает выбранный сервер через количество секунд, указанное в аргументе Без аргументов начинает перезапуск сразу

source: help_restart_timeout
ru: Время ожидания перед началом перезапуска, в секундах

source: help_brief_role
ru: Управляет ролями для некоторых функций бота

source: help_role
ru: Управляет ролями для некоторых функций бота Без подкоманд возвращает информацию о связанных ролях

source: help_role_admin
ru: **Только для админа!** Сохраняет роль админа для бота

source: help_role_admin_role
ru: Упоминание роли, типа '@Роль' или id роли, если вы разработчик

source: help_role_admin_clear
ru: **Только для админа!** Отвязывает роль админа для бота

source: help_role_command
ru: **Только для админа!** Сохраняет роль для команд, которые управляют майнкрафт сервером

source: help_role_command_role
ru: Упоминание роли, типа '@Роль' или id роли, если вы разработчик

source: help_role_command_clear
ru: **Только для админа!** Отвязывает роль для команд, которые управляют майнкрафт сервером

source: help_brief_rss
ru: Управляет настройками для RSS

source: help_rss
ru: Управляет настройками для RSS Возвращает информацию об RSS

source: help_rss_interval
ru: Обновляет интервал сканирования для RSS-канала

source: help_rss_interval_seconds
ru: Целое количество секунд

source: help_rss_off
ru: **Только для админа!** Отключает RSS

source: help_rss_on
ru: **Только для админа!** Включает RSS

source: help_rss_url
ru: Обновляет URL-адрес RSS-канала

source: help_rss_url_url
ru: URL-адрес RSS-канала

source: help_rss_webhook
ru: Управляет настройками RSS вебхука Возвращает информацию о настройках для этого вебхука

source: help_rss_webhook_avatar
ru: Обновлен аватар для RSS вебхука Бот ищет изображение либо по URL-адресу, либо во вложениях сообщения

source: help_rss_webhook_avatar_avatar_url
ru: URL-адрес для поиска

source: help_rss_webhook_channel
ru: Обновляет канал по умолчанию для RSS вебхука

source: help_rss_webhook_channel_channel
ru: Упоминание канала, типа '#канал' или id канала, если вы разработчик

source: help_rss_webhook_name
ru: Обновлено имя RSS вебхука

source: help_rss_webhook_name_name
ru: Новое имя вебхука

source: help_rss_webhook_reload
ru: Перезагружает RSS вебхук для бота Если бот не может найти связанный вебхук, то он создаст новый

source: help_brief_schedule
ru: Показывает информацию о планируемых задачах

source: help_schedule
ru: Показывает текущее состояние задач: - Плановое отключение (shutdown) - Постоянное включение (forceload)

source: help_schedule_forceload
ru: Позволяет настроить/отобразить текущее состояние задачи "Автоматическая загрузка в случае сбоя сервера"

source: help_schedule_forceload_off
ru: Отключает задачу "Автоматической загрузки в случае сбоя сервера"

source: help_schedule_forceload_on
ru: Активирует задачу "Автоматической загрузки в случае сбоя сервера"

source: help_schedule_shutdown
ru: Позволяет настроить/отобразить текущее состояние задачи "Отключение сервера при простое (нет игроков онлайн)"

source: help_schedule_shutdown_off
ru: Отключает задачу "Отключения майнкрафт сервера при простое"

source: help_schedule_shutdown_on
ru: Активирует задачу "Отключения майнкрафт сервера при простое"

source: help_schedule_shutdown_timeout
ru: Изменяет время ожидания перед отключением майнкрафт сервера при простое Без аргументов показывает текущее время ожидания

source: help_schedule_shutdown_timeout_new_value
ru: Время ожидания перед остановкой сервера, в секундах

source: help_brief_server
ru: Управляет майнкрафт серверами бота (͠◉_◉᷅ )

source: help_server
ru: Управляет доступными майнкрафт серверами бота Возвращает выбранное название сервера

source: help_server_list
ru: Возвращает список доступных майнкрафт серверов бота

source: help_server_select
ru: Выбирает сервер из доступных майнкрафт серверов бота Возвращает выпадающее меню со списоком доступных майнкрафт серверов бота для выбора

source: help_brief_start
ru: Запускает сервер

source: help_start
ru: Запускает выбранный сервер

source: help_brief_status
ru: Возвращает статус сервера

source: help_status
ru: Возвращает статус выбранного сервера, имя выбранного сервера, информацию о том, когда сервер был запущен и остановлен, если это произошло

source: help_status_update
ru: Обновляет статус выбранного сервера

source: help_brief_stop
ru: Останавливает сервер

source: help_stop
ru: Останавливает выбранный сервер через количество секунд, указанное в аргументе Без аргументов начинает остановку сразу

source: help_stop_timeout
ru: Время ожидания перед началом остановки, в секундах

source: help_brief_whitelist
ru: Команда 'whitelist' из майнрафта

source: help_whitelist
ru: Реализует весь функционал команды 'whitelist' из майнкрафта Ограничивает доступ к серверу, войти могут только игроки, ники которых есть в списке Показывает, включено ли ограничение

source: help_whitelist_add
ru: Добавляет ник майнкрафта в список разрешённых ников

source: help_whitelist_add_minecraft_nick
ru: Ник игрока майнкрафта

source: help_whitelist_list
ru: Возвращает список разрешённых ников

source: help_whitelist_off
ru: Разрешает серверу пускать любых игроков независимо от списка разрешённых ников

source: help_whitelist_on
ru: Запрещает серверу пускать игроков не из списка разрешённых ников

source: help_whitelist_reload
ru: Перезагружает список разрешённых ников

source: help_whitelist_remove
ru: Удаляет ник майнкрафта из списка разрешённых ников

source: help_whitelist_remove_minecraft_nick
ru: Ник игрока майнкрафта

source: Add Reactions
ru: Добавлять реакции

source: Administrator
ru: Администратор

source: Attach Files
ru: Прикреплять файлы

source: Ban Members
ru: Банить участников

source: Change Nickname
ru: Изменить никнейм

source: Connect
ru: Подключаться

source: Create Events
ru: Создавать события

source: Create Expressions
ru: Создавать выражения

source: Create Instant Invite
ru: Создание приглашения

source: Create Polls
ru: Создание опросов

source: Create Private Threads
ru: Создание приватных веток

source: Create Public Threads
ru: Создать публичные ветки

source: Deafen Members
ru: Отключать участникам звук

source: Embed Links
ru: Встраивать ссылки

source: External Emojis
ru: Внешние эмодзи

source: External Stickers
ru: Внешние стикеры

source: Kick Members
ru: Выгонять участников

source: Manage Channels
ru: Управлять каналами

source: Manage Emojis
ru: Управлять эмодзи и стикерами

source: Manage Emojis And Stickers
ru: Управлять эмодзи и стикерами

source: Manage Events
ru: Управление событиями

source: Manage Expressions
ru: Управлять выражениями

source: Manage Server
ru: Управлять сервером

source: Manage Messages
ru: Управлять сообщениями

source: Manage Nicknames
ru: Управлять никнеймами

source: Manage Permissions
ru: Управлять ролями доступа

source: Manage Roles
ru: Управлять ролями

source: Manage Threads
ru: Управление ветками

source: Manage Webhooks
ru: Управлять вебхуками (webhooks)

source: Mention Everyone
ru: Упоминание @everyone, @here и всех ролей

source: Moderate Members
ru: Отправить участников подумать о своём поведении

source: Move Members
ru: Перемещать участников

source: Mute Members
ru: Отключать участникам микрофон

source: Priority Speaker
ru: Приоритетный режим

source: Read Message History
ru: Читать историю сообщений

source: Read Messages
ru: Читать сообщения

source: Request To Speak
ru: Разрешение на включение микрофона

source: Send Messages
ru: Отправлять сообщения

source: Send Messages In Threads
ru: Отправлять сообщения в ветках

source: Send Polls
ru: Отправлять опросы

source: Send Tts Messages
ru: Отправка сообщений text-to-speech

source: Send Voice Messages
ru: Отправлять голосовые сообщения

source: Speak
ru: Говорить

source: Stream
ru: Видео

source: Use Application Commands
ru: Использовать команды приложения

source: Use Embedded Activities
ru: Использовать активности

source: Use External Apps
ru: Использовать внешние приложения

source: Use External Emojis
ru: Использовать внешние эмодзи

source: Use External Sounds
ru: Использовать внешние звуки

source: Use External Stickers
ru: Использовать внешние стикеры

source: Use Soundboard
ru: Использовать звуковую панель

source: Use Voice Activation
ru: Использовать режим активации по голосу

source: View Audit Log
ru: Просматривать журнал аудита

source: View Channel
ru: Просматривать каналы

source: View Creator Monetization Analytics
ru: Просмотр аналитики монетизации создателя

source: View Server Insights
ru: Просмотр статистику сервера

source: Logged in Discord as
ru: Авторизовался в дискорде как

source: Version of discord.py
ru: Версия discord.py

source: Version of Python
ru: Версия Python

source: Bot couldn't find message for server menu! Deleting its id from config!
ru: Бот не смог найти сообщение для меню сервера! Удаляем его id из конфига!

source: Bot couldn't find message for bot menu! Deleting its id from config!
ru: Бот не смог найти сообщение для меню бота! Удаляем его id из конфига!

source: Bot is ready!
ru: Бот готов к работе!

source: To stop the bot press Ctrl + C
ru: Чтобы остановить бота, нажмите Ctrl + C

source: Channel {0} set as commands' channel for bot
ru: Канал {0} настроен как канал команд для бота

source: Channel for bot commands is not found or unreachable!
ru: Канал для команд бота не найден или недоступен!

source: Role {0} set as role for commands that manage Minecraft server
ru: Роль {0} задана в качестве роли для команд, которые управляют майнкрафт сервером

source: Role for commands that manage Minecraft server not stated
ru: Роль для команд, которые управляют майнкрафт сервером, не задана

source: Role {0} set as admin role for bot
ru: Роль {0} установлена в качестве роли админа для бота

source: Admin role not stated
ru: Роль админа не указана

source: Role for commands that manage Minecraft server has been cleared
ru: Роль для команд, которые управляют майнкрафт сервером, была очищена

source: Admin role has been cleared
ru: Роль админа была очищена

source: Game chat enabled
ru: Игровой чат включён

source: Webhook for game chat set to `{0}` owned by {1} and to channel {2}
ru: Вебхук для игрового чата установлен на `{0}`, принадлежащий {1} и на канал {2}

source: Channel {0} set to Minecraft game chat
ru: Канал {0} настроен на игровой чат майнкрафта

source: Channel for Minecraft game chat is not found or unreachable!
ru: Канал для игрового чата майнкрафта не найден или недоступен!

source: Webhook for game chat not set!
ru: Вебхук для игрового чата не установлен!

source: Image preview enabled
ru: Предварительный просмотр изображения включён

source: Image preview disabled
ru: Предварительный просмотр изображения выключен

source: Obituary enabled
ru: Некролог включён

source: Obituary disabled
ru: Некролог выключен

source: Game chat disabled
ru: Игровой чат выключен

source: Webhook name for death messages set to {0}
ru: Имя вебхука для сообщений о смерти установлено как {0}

source: Webhook name for death messages set to default - {0}
ru: Имя вебхука для сообщений о смерти установлено по умолчанию как - {0}

source: Avatar URL for death messages set to {0}
ru: URL-адрес аватара для сообщений о смерти установлен на {0}

source: Avatar URL for death messages not set!
ru: URL-адрес аватара для сообщений о смерти не задан!

source: This nick is already associated with member {0}.
ru: Этот ник уже ассоциирован с участником {0}.

source: Webhook name for death messages has been cleared and set to default
ru: Имя вебхука для сообщений о смерти было очищено и установлено по умолчанию

source: Unsupported image type was given!
ru: Был передан неподдерживаемый тип изображения!

source: Do not delete this message or attachment(s)!
ru: Не удаляйте это сообщение или вложение(ия)!

source: You can't edit messages from other members with this command!
ru: Вы не можете редактировать сообщения от других участников с помощью этой команды!

source: {0}, this nick isn't bound to you, use `{1}associate add` first...
ru: {0}, этот ник не привязан к вам, воспользуйся `{1}associate add` сначала...

source: The bot couldn't find any messages sent by your bound Minecraft accounts in the last 100 messages!
ru: Бот не смог найти никаких сообщений, отправленных вашими связанными майнкрафт аккаунтами среди последних 100 сообщений!

source: {0}, you have no bound nicks
ru: {0}, у вас нет привязанных ников

source: Can't edit this message, it's not owned by game chat webhook!
ru: Невозможно изменить сообщение, оно не принадлежит вебхуку игрового чата!

source: Owner:
ru: Владелец:

source: webhook {0} owned by {1}
ru: вебхук {0}, принадлежащий {1}

source: You're not in channel for Minecraft game chat!
ru: Вы не в канале для игрового чата майнкрафта!

source: The maximum image width set to {0}
ru: Максимальная ширина изображения установлена на {0}

source: The maximum image height set to {0}
ru: Максимальная высота изображения установлена на {0}

source: Wrong 1-st argument used!
ru: Использован неверный 1-й аргумент!

source: Integer must be above or equal {0}!
ru: Целое число должно быть больше или равно {0}!

source: Integer must be below or equal {0}!
ru: Целое число должно быть меньше или равно {0}!

source: Reloaded webhook for game chat!
ru: Перезагружен вебхук для игрового чата!

source: Updated webhook name to `{0}`!
ru: Имя вебхука изменено на `{0}`!

source: Updated webhook avatar!
ru: Обновлён аватар вебхука!

source: Channel {0} set to Minecraft game chat and as default channel for its webhook
ru: Канал {0} настроен на игровой чат майнкрафта, а для его вебхука как канал по умолчанию

source: RSS enabled
ru: RSS включён

source: Webhook for RSS set to `{0}` owned by {1} and to channel {2}
ru: Вебхук для RSS настроен на `{0}`, принадлежащий {1}, и на канал {2}

source: Webhook for RSS not set!
ru: Вебхук для RSS не указан!

source: URL for RSS set to {0}
ru: URL-адрес для RSS поставлен на {0}

source: URL for RSS not set!
ru: URL-адрес для RSS не указан!

source: Scan interval for RSS feed set to `{0}`
ru: Интервал сканирования для RSS-канала установлен как `{0}`

source: Scan interval for RSS feed not set
ru: Интервал сканирования для RSS-канала не установлен

source: RSS disabled
ru: RSS выключен

source: Reloaded webhook for RSS!
ru: Перезагружен вебхук для RSS!

source: Channel {0} set to RSS webhook as default channel
ru: Канал {0} настроен как канал по умолчанию для RSS вебхука

source: Available languages:
ru: Доступные языки:

source: Select bot language:
ru: Выберите язык бота:

source: Current prefix - '{0}'
ru: Текущий префикс - '{0}'

source: Prefix can't have spaces!
ru: Префикс не может иметь пробелов!

source: Changed prefix to '{0}'.
ru: Префикс изменён на '{0}'.

source: Bot doesn't have such subcommand!
ru: Бот не имеет такой подкоманды!

source: Bot doesn't have such command!
ru: Бот не имеет такой команды!

source: List of all commands, prefix - {0}
ru: Список всех команд, префикс - {0}

source: Values in [square brackets] are optional. Values in <angle brackets> have to be provided by you. The | sign means one or the other. Use '{prefix}help' command for more info. Or '{prefix}command {arg_list}' for short.
ru: Значения в [квадратных скобках] необязательны. Значения в <угловых скобках> должны быть предоставлены вами. Знак | означает одно из них. Для получения дополнительной информации используйте команду '{prefix}help'. Или для удобства - '{prefix}команда {arg_list}'.

source: You didn't provide reply in your message!
ru: Вы не прикрепили ответ к вашему сообщению!

source: Starting RSS feed check
ru: Запускаем проверку RSS-канала

source: Updated bot status!
ru: Обновлён статус бота!

source: Getting an operator to Minecraft players is enabled
ru: Получение оператора для игроков майнкрафта включено

source: Getting an operator to Minecraft players is disabled
ru: Получение оператора для игроков майнкрафта выключено

source: Integer must be above {0}!
ru: Целое число должно быть больше {0}!

source: There is no history of giving an operator to players yet...
ru: Истории получения оператора игроками пока нет...

source: Timeout for being operator in Minecraft set to {0} sec.
ru: Время ожидания для оператора в майнкрафте установлено на {0} сек.

source: Limitation doesn't exist, padawan.
ru: Ограничения не существует, падаван.

source: Secure authorization on
ru: Безопасная авторизация включена

source: Secure authorization off
ru: Безопасная авторизация выключена

source: Login attempts allowed - {0}
ru: Разрешено попыток входа - {0}

source: Session expiration time in days - {0}
ru: Время истечения сессии в днях - {0}

source: Code expiration time in minutes - {0}
ru: Время истечения кода в минутах - {0}

source: Information about authorized users:
ru: Информация об авторизованных пользователях:
