Repository: Druzai/Bot_Mc_discord
Catalog: locales/*/LC_MESSAGES/lang.po
Languages: ru

source: Secure authorization is disabled. Enable it to proceed!
ru: Безопасная авторизация выключена. Включите её чтобы продолжить!

source: Bot couldn't find nick and/or code in the IP-addresses without access!
ru: Бот не нашёл ник и/или код в IP-адресах без доступа!

source: {0}, bot already has poll on `auth login {1}` command!
ru: {0}, у бота уже есть опрос по команде `auth login {1}`!

source: You don't have this nick in associations!
ru: У вас этот ник не в ассоциациях!

source: This code expired! Try to login again to get another one!
ru: Этот код просрочен! Попытайтесь авторизоваться ещё раз, чтобы получить другой код!

source: this man {0} is trying to login as `{1}`. Bot requesting create link {0} -> {1}. Will you let that happen?
ru: этот человек {0} пытается зайти как `{1}`. Бот запрашивает разрешение создать связь {0} -> {1}. Дадите ли вы этому произойти?

source: {0}, you don't have permission to control fates! Not in this life at least...
ru: {0}, у вас нет разрешения управлять судьбами! По крайней мере, не в этой жизни...

source: {0}, bot gave access to the nick `{1}` with IP-address `{2}`!
ru: {0}, бот дал доступ нику `{1}` с IP-адресом `{2}`!

source: Unbanned IP-address {0}!
ru: Разбанен IP-адрес {0}!

source: Your code for this nick is wrong. Try again.
ru: Ваш код для этого ника неправильный. Попробуйте снова.

source: Reason:
ru: Причина:

source: List of banned IP-addresses:
ru: Список забаненных IP-адресов:

source: There are no banned IP-addresses!
ru: Нет забаненных IP-адресов!

source: {0}, you don't have bound nicks, use `{1}associate add` first...
ru: {0}, этот ник не привязан к вам, воспользуйся `{1}associate add` сначала...

source: {0}, there are no nicks in your possession that were logged on with this IP-address
ru: {0}, нет ников в вашем распоряжении, которые авторизовывались по этому IP-адресу

source: with reason '{0}'
ru: по причине '{0}'

source: Banned IP-address {0}{1}!
ru: Забанен IP-адрес {0}{1}!

source: You provided wrong IP-address in chosen option! Try again
ru: Вы предоставили неверный IP-адрес в выбранной опции! Попробуйте ещё раз

source: Select from the list of banned IP-addresses:
ru: Выберите из списка забаненных IP-адресов:

source: Bot has no users who tried to enter or entered Minecraft server!
ru: У бота нет пользователей, кто пытался войти или вошёл на майнкрафт сервер!

source: {0}, there are no nicks that were logged on with this IP-address
ru: {0}, нет ников, которые авторизовывались по этому IP-адресу

source: These nicks were revoked with this IP-address:
ru: Эти ники были отозваны с этим IP-адресом:

source: One of the sessions for this nick has been ended
ru: Одна из сессий у этого ника была завершена

source: These nicks bound this IP-address were kicked from Minecraft server:
ru: Эти ники, связанные этим IP-адресом, были кикнуты с майнкрафт сервера:

source: All these nicks were revoked:
ru: Все эти ники были отозванны:

source: All sessions for this nick have been ended
ru: Все сессии у этого ника были завершены

source: These nicks were kicked from Minecraft server:
ru: Эти ники были кикнуты с майнкрафт сервера:

source: The server only allows players from the list of allowed nicks
ru: Сервер пускает только игроков из списка разрешённых ников

source: The server allows players regardless of their nick
ru: Сервер пускает игроков независимо от их ника

source: Added {0} to the list of allowed nicks
ru: {0} добавлен в список разрешённых ников

source: Nick wasn't added to the list of allowed nicks
ru: Ник не был добавлен в списк разрешённых ников

source: Removed {0} from the list of allowed nicks
ru: {0} удалён из список разрешённых ников

source: Nick wasn't found in the list of allowed nicks
ru: Ник не был найден в списке разрешённых ников

source: Allowed nicks - {0}: {1}
ru: Разрешено ников - {0}: {1}

source: No nicks allowed to login
ru: Нет разрешённых ников для входа

source: The server is forbidden to let players not from the list of allowed nicknames
ru: Серверу запрещено пускать игроков не из списка разрешённых ников

source: The server is allowed to let any players regardless of the list of allowed nicknames
ru: Серверу разрешено пускать любых игроков независимо от списка разрешённых ников

source: Reloaded the list of allowed nicks
ru: Список разрешённых ников перезагружен

source: Selected server
ru: Выбранный сервер

source: Select Minecraft server:
ru: Выберите майнкрафт сервер:

source: List of servers
ru: Список серверов

source: Automatic backups enabled
ru: Автоматическое резервное копирование включено

source: Automatic backups disabled
ru: Автоматическое резервное копирование выключено

source: Automatic backups period set to {0} min
ru: Период автоматического резервного копирования поставлен в {0} мин

source: Automatic backups period can't be lower than 0!
ru: Период автоматического резервного копирования не может быть ниже 0!

source: Compression method set to {0}
ru: Установлен метод сжатия {0}

source: Current compression method - {0}
ru: Текущий метод сжатия - {0}

source: Bot doesn't have such compression method! Supported:
ru: Бот не имеет такого метода сжатия! Поддерживаемые:

source: Supported compression methods:
ru: Поддерживаемые методы сжатия:

source: There are no backups for '{0}' server!
ru: На '{0}' сервере нет резервных копий!

source: {0}, bot already has poll on `backup remove all` command!
ru: {0}, у бота уже есть опрос по команде `backup remove all`!

source: this man {0} is trying to delete all backups of `{1}` server. Will you let that happen?
ru: этот человек {0} пытается удалить все резервные копии сервера `{1}`. Дадите ли вы этому произойти?

source: Deleted all backups of '{0}' server
ru: Удалены все резервные копии сервера '{0}'

source: Server menu was found in {0} Link - {1}
ru: Меню сервера было найдено в {0} Ссылка - {1}

source: Server menu wasn't found!
ru: Меню сервера не было найдено!

source: Bot menu was found in {0} Link - {1}
ru: Меню бота было найдено в {0} Ссылка - {1}

source: Bot menu wasn't found!
ru: Меню бота не было найдено!

source: List of commands for interacting with Minecraft server via buttons and dropdown for selecting server
ru: Список команд для взаимодействия с майнкрафт сервером с помощью кнопок и выпадающего списка для выбора сервера

source: List of bot features for interaction via buttons and dropdown for selecting bot language
ru: Список функций бота для взаимодействия с помощью кнопок и выпадающего списка для выбора языка бота

source: Starting Minecraft server check-ups
ru: Запускаем проверки майнкрафт сервера

source: To win the poll needed {0} vote(s)!
ru: Для победы в опросе необходимо {0} голос(ов)!

source: Poll result: canceled!
ru: Результат опроса: отменён!

source: granted
ru: получено

source: refused
ru: отказано

source: Poll result: permission {0}!
ru: Результат опроса: разрешение {0}!

source: Voting!
ru: Голосовалочка!

source: yes
ru: да

source: no
ru: нет

source: what are you doing? Time hasn't passed yet. Waiting {0} sec...
ru: что вы делаете? Время ещё не прошло. Ждём {0} сек...

source: poll have already finished!
ru: опрос уже завершён!

source: you've already voted!
ru: вы уже проголосовали!

source: you don't have needed '{0}' role
ru: у вас нету нужной роли '{0}'

source: you don't have permission 'Administrator'
ru: у вас нету права доступа 'Администратор'

source: Bot is backing up server!
ru: Бот делает резервное копирование сервера!

source: server have already started!
ru: сервер уже запущен!

source: Bot is restoring server from backup!
ru: Бот восстанавливает сервер из резервной копии!

source: server is loading!
ru: сервер загружается!

source: server is stopping!
ru: сервер останавливается!

source: server have already been stopped!
ru: сервер уже был остановлен!

source: Loading server by request of {0}
ru: Загружаем сервер по запросу {0}

source: Loading server....... Please wait)
ru: Загружаем сервер....... Пожалуйста, ожидайте)

source: Script '{0}' doesn't exist.
ru: Скрипт '{0}' не существует.

source: Couldn't open script because it doesn't exists! Retreating...
ru: Не удалось запустить скрипт из-за его отсутствия! Отбой...

source: Target script of this shortcut '{0}' doesn't exists.
ru: Целевого скрипта для этого ярлыка '{0}' не существует.

source: Couldn't open shortcut because target script doesn't exists! Retreating...
ru: Не удалось запустить ярлык из-за отсутствия целевого скрипта! Отбой...

source: Couldn't open script! Check naming and extension of the script!
ru: Не удалось запустить скрипт! Проверьте имя и расширение скрипта!

source: Couldn't open script because of naming! Retreating...
ru: Не удалось запустить скрипт из-за названия! Отбой...

source: Couldn't find a way to start the server! Use supported operation systems!
ru: Не удалось найти способ запустить сервер! Используйте поддерживаемые операционные системы!

source: Couldn't find a way to start the server! Retreating...
ru: Не удалось найти способ запустить сервер! Отбой...

source: Couldn't open script because there is no command 'screen'! Install it via packet manager!
ru: Не удалось запустить скрипт, так как нет команды 'screen'! Установите её через пакетный менеджер!

source: Couldn't open script because command 'screen' wasn't installed! Retreating...
ru: Не удалось запустить скрипт, так как команда 'screen' не установлена! Отбой...

source: Couldn't open shortcut because target of this shortcut '{0}' isn't '*.bat' file or '*.cmd' file.
ru: Не удалось запустить скрипт, так как целью этого ярлыка '{0}' не являются файлы '*.bat' или '*.cmd'.

source: Couldn't open shortcut because target file isn't a script! Retreating...
ru: Не удалось запустить ярлык, потому что целевой файл не является скриптом! Отбой...

source: Error while loading server! Retreating...
ru: Ошибка пока загружается сервер! Отбой...

source: Loading:
ru: Загрузка:

source: {0}, elapsed time:
ru: {0}, прошедшее время:

source: Server is running
ru: Сервер работает

source: Server is up!
ru: Сервер поднят!

source: Kept you waiting, huh?
ru: Заставил тебя ждать, а?

source: {0}, bot already has poll on `stop`/`restart` command!
ru: {0}, у бота уже есть опрос по команде `stop`/`restart`!

source: Bot Exception: Couldn't connect to server, because it's stopped
ru: Исключение бота: Не удалось подключиться к серверу, потому что он остановлен

source: Couldn't connect to server to shut it down! Server stopped...
ru: Не удалось подключиться к серверу, чтобы выключить его! Сервер остановлен...

source: this man {0} is trying to stop the server with {1} player(s) on it. Will you let that happen?
ru: этот человек {0} пытается остановить сервер с {1} игрок(ами) на нём. Дадите ли вы этому произойти?

source: Stopping server by request of {0}
ru: Останавливаем сервер по запросу {0}

source: Stopping server
ru: Останавливаем сервер

source: Please wait {0} sec.
ru: Пожалуйста, ожидайте {0} сек.

source: Server will shut down in {0} seconds
ru: Сервер выключится через {0} секунд

source: Server will restart in {0} seconds
ru: Сервер перезагрузится через {0} секунд

source: {0} sec to go
ru: Осталось {0} сек

source: Bot Exception: Couldn't connect to server, so killing it now...
ru: Исключение бота: Не удалось подключиться к серверу, поэтому насильно его сейчас выключаем...

source: Couldn't connect to server to shut it down! Killing it now...
ru: Не удалось подключиться к серверу, чтобы выключить его! Насильно его сейчас выключаем...

source: Server is down
ru: Сервер выключен

source: Server has been shut down!
ru: Сервер был выключен!

source: Starting auto backup
ru: Запуск автоматического резервного копирования

source: Backup completed!
ru: Резервное копирование завершено!

source: Bot couldn't archive some files to this backup, they located in path '{0}'
ru: Бот не смог заархивировать некоторые файлы в эту резервную копию, они расположены по пути '{0}'

source: List of these files:
ru: Список этих файлов:

source: The world folder in path '{0}' doesn't exist or is empty!
ru: Папка мира по пути '{0}' не существует или пуста!

source: Backup cancelled!
ru: Резервное копирование отменено!

source: Starting backup triggered by {0} in 3 seconds...
ru: Запуск резервного копирования по требованию {0} через 3 секунды...

source: Starting automatic backup in 3 seconds...
ru: Запуск автоматического резервного копирования через 3 секунды...

source: Saving chunks...
ru: Сохраняем чанки...

source: Chunks saved!
ru: Чанки сохранены!

source: Creating zip-archive for backup!
ru: Создание zip-архива для резервного копирования!

source: Done in {0} Compression method: {1}
ru: Сделано за {0} Метод сжатия: {1}

source: Bot couldn't archive some files into this backup!
ru: Бот не смог заархивировать некоторые файлы в эту резервную копию!

source: Bot couldn't archive some files to this backup!
ru: Бот не смог заархивировать некоторые файлы в эту резервную копию!

source: Deleted auto backup dated {0} because of {1}
ru: Удалена автоматическая резервная копия от {0} из-за {1}

source: Deleted backup dated {0} made by {1} because of {2}
ru: Удалена резервная копия от {0}, сделанная {1}, из-за {2}

source: Deleted all backups because of {0}
ru: Удалены все резервные копии из-за {0}

source: backups' count limit
ru: предела количества резервных копий

source: lack of space
ru: нехватки места

source: Bot has backups only from members for `{0}` server, so keep in mind, that bot will delete oldest backup on next auto backup!
ru: У бота есть резервные копии только от участников сервера `{0}`, поэтому имейте в виду, что бот удалит самую старую копию при следующем автоматическом резервном копировании!

source: sec
ru: сек

source: min
ru: мин

source: player(s) online
ru: игрок(ов) в сети

source: Bot detected: Server is idle for {0} without players! Stopping server now!
ru: Бот обнаружил: Простой сервера в течение {0} без игроков! Выполняется отключение сервера!

source: Bot detected: Server is idle for {0} without players! Time: {1} Shutting down server now!
ru: Бот обнаружил: Простой сервера в течение {0} без игроков! Время: {1} Выполняется отключение сервера!

source: Server unexpectedly stopped!
ru: Сервер был неожиданно остановлен!

source: Bot detected: Server offline! Starting up server again!
ru: Бот обнаружил: Сервер выключен! Снова запускаем сервер!

source: Bot detected: Server offline! Time: {0} Starting up server again!
ru: Бот обнаружил: Сервер выключен! Время: {0} Снова запускаем сервер!

source: Server has been started at {0} by member {1}
ru: Сервер запущен участником {1} в {0}

source: Server has started at {0}
ru: Сервер запустился в {0}

source: Server has been stopped at {0} by member {1}
ru: Сервер остановлен участником {1} в {0}

source: Server has stopped at {0}
ru: Сервер остановился в {0}

source: Server has crashed at {0}
ru: Сервер упал в {0}

source: Server address:
ru: Адрес сервера:

source: Server is backing up
ru: Создаётся резервная копия сервера

source: Server is restoring from backup
ru: Сервер восстанавливается из резервной копии

source: Selected server: {0}
ru: Выбранный сервер: {0}

source: Average server loading time: {0}
ru: Среднее время загрузки сервера: {0}

source: server online
ru: сервер в сети

source: Time in Minecraft:
ru: Время в майнкрафте:

source: Day
ru: День

source: Sunset
ru: Закат

source: Night
ru: Ночь

source: Sunrise
ru: Восход

source: Server version: {0}
ru: Версия сервера: {0}

source: Server thinking...
ru: Сервер думает...

source: Server isn't available via RCON
ru: Сервер недоступен через rcon

source: server offline
ru: сервер не в сети

source: There are no players on the server
ru: На сервере нет игроков

source: from
ru: с

source: Players online: {0} / {1}
ru: Игроков в сети: {0} / {1}

source: Some player(s) still have an operator, waiting for them
ru: У некоторых игроков всё ещё есть оператор, ожидаем их

source: Restarting server
ru: Перезагружаем сервер

source: You should mention ONLY members or roles of this server!
ru: Вы можете упоминать ТОЛЬКО участников и роли этого сервера!

source: Nothing's done!
ru: Ничего не сделано!

source: {0}, bot already has poll on `clear` command for this channel!
ru: {0}, у бота уже есть опрос по команде `clear` для данного канала!

source: this man {0} is trying to delete some history of this channel. Will you let that happen?
ru: этот человек {0} пытается удалить часть истории этого канала. Дадите ли вы этому произойти?

source: Max backups' count limit for server - {0}
ru: Максимальный предел количества копий для сервера - {0}

source: Max backups' size limit for server - {0}
ru: Максимальный предел размера копий для сервера - {0}

source: Backups folder info for '{0}' server:
ru: Информация о папке резервных копий для сервера '{0}':

source: Used - {0}
ru: Занято - {0}

source: Free - {0}
ru: Свободно - {0}

source: Stored backups count - {0}
ru: Количество сохранённых копий - {0}

source: Approximate remaining backups count - {0}
ru: Приблизительное количество оставшихся копий - {0}

source: Last backup:
ru: Последняя резервная копия:

source: Backup size:
ru: Размер копии:

source: Automatic backup
ru: Автоматическое копирование

source: Not stated
ru: Не указана

source: Initiator:
ru: Создал:

source: The world of the server was restored from this backup
ru: Мир сервера был восстановлен из этой копии

source: List of backups for '{0}' server:
ru: Список резервных копий сервера '{0}':

source: Date:
ru: Дата:

source: Backup from
ru: Резервная копия от

source: Now {0} associates with nick `{1}` in Minecraft.
ru: Теперь {0} ассоциируется с ником `{1}` в майнкрафте.

source: Now link {0} -> `{1}` do not exist!
ru: Теперь связи {0} -> `{1}` не существует!

source: Bot don't have `mention to nick` link already!
ru: У бота уже нету `упоминание - ник` связи!

source: {0}, bot has this data on nicks and number of remaining uses:
ru: {0}, у бота есть такие данные по никам и кол-ву оставшихся использований:

source: {0}, bot has this data on nicks:
ru: {0}, у бота есть такие данные по никам:

source: not seen on server
ru: не замечен на сервере

source: Shutdown of Minecraft server when idle
ru: Отключение сервера при простое

source: Task:
ru: Задача:

source: State:
ru: Состояние:

source: Active
ru: Активна

source: Disabled
ru: Отключена

source: Timeout: {0} sec
ru: Время ожидания: {0} сек

source: Server will be stopped immediately.
ru: Сервер будет немедленно остановлен.

source: Autoload if server crashes
ru: Автоматическая загрузка в случае сбоя сервера

source: Description
ru: Описание

source: Aliases
ru: Псевдонимы

source: Subcommands
ru: Подкоманды

source: Parameters
ru: Параметры

source: You can't change server, while some instance is still running Please stop it, before trying again
ru: Вы не можете менять сервер, пока некоторый экземпляр всё ещё работает Пожалуйста, остановите его, прежде чем попытаться снова

source: Server properties read!
ru: Настройки сервера прочтены!

source: {0}, I didn't see this nick on server, son! Go to the server via this nick before...
ru: {0}, я не видел этого ника на сервере, сынок! Отметься на сервере перед этим...

source: {0}, you had run out of attempts to get an operator for `{1}` nick!
ru: {0}, вы исчерпали кол-во попыток получить оператора для данного `{1}` ника!

source: {0}, I didn't see this nick `{1}` online!
ru: {0}, я не видел в сети данный ник `{1}`!

source: {0}, you've already been given an operator!
ru: {0}, вам уже был выдан оператор!

source: {0}, I can't give an operator to this nick `{1}` because it contains spaces!
ru: {0}, я не могу дать оператора на этот ник `{1}`, потому что он содержит пробелы!

source: Opped
ru: Op'нут

source: you've been given an operator for
ru: вам был выдан оператор на

source: {0}, server isn't working (at least I've tried), try again later...
ru: {0}, а сервак-то не работает (по крайней мере я пытался), попробуй-ка позже...

source: So {0}, I gave you an operator, but I'm not going to pretend like I did it to win favors upstairs. I'll come in {1}, take away operator from everyone and we're even. I don't give a shit why you want this operator and mind my own business. If you want it, well, you must have your reasons...
ru: Короче, {0}, я дал тебе оператора и в благородство играть не буду: приду через {1}, заберу у всех операторов - и мы в расчёте. Хрен его знает, на кой ляд тебе этот оператор сдался, но я в чужие дела не лезу, если хочешь получить, значит есть на что...

source: Now {0} is an operator!
ru: Теперь {0} - оператор!

source: the operator will be taken away from {0} players now.
ru: у {0} игроков сейчас заберут оператора.

source: the operator will be taken away from you.
ru: у тебя сейчас заберут оператора.

source: Deopped all
ru: Deop'нул всех

source: || Note:
ru: || Заметка:

source: from {0} people in belated list operator was taken away
ru: у {0} людей в задерживающем списке был изъят оператор

source: Well, {0}, your time is over...
ru: Ну что, {0}, кончилось твоё время...

source: and not only yours...
ru: и не только твоё...

source: As they say "Cheeki breeki i v damké!"
ru: Как говорится "Чики-брики и в дамки!"

source: The operator was taken away from {0}
ru: Оператор был изъят у {0}

source: and {0} player(s)
ru: и {0} игрок(ов)

source: {0}, you have no time limit, but you are all doomed...
ru: {0}, у вас нет ограничения по времени, но вы все обречены...

source: Status
ru: Статус

source: Players online
ru: Игроки в сети

source: Update
ru: Обновить

source: Get an operator
ru: Получить оператора

source: Backups
ru: Резервные копии

source: List
ru: Список

source: Create
ru: Создать

source: Restore
ru: Восстановить

source: Delete
ru: Удалить

source: Server
ru: Сервер

source: Start
ru: Включить

source: Stop
ru: Отключить

source: Restart
ru: Перезапустить

source: Getting an operator
ru: Получение оператора

source: What is the player's nick?
ru: Какой ник у игрока?

source: Type here...
ru: Введите здесь...

source: What is the reason for getting an operator?
ru: В чём причина получения оператора?

source: Type here... (you can leave this blank)
ru: Введите здесь... (вы можете оставить это поле пустым)

source: Backup reason
ru: Причина для резервной копии

source: What is the reason for creating this backup?
ru: В чём причина создания этой резервной копии?

source: Can't create backup because of {0} Delete some backups to proceed!
ru: Не возможно создать резервную копию из-за {0} Удалите некоторые копии, чтобы продолжить!

source: Starting backup triggered by {0}
ru: Запуск резервного копирования по требованию {0}

source: Starting backup...
ru: Начинаем резервное копирование...

source: The world folder '{0}' doesn't exist or is empty!
ru: Папка мира '{0}' не существует или пуста!

source: Bot couldn't find backup by provided date '{0}'
ru: Бот не смог найти резервную копию по указанной дате '{0}'

source: There are not enough space on disk to restore from backup! Free - {0} Required at least - {1} Delete some backups to proceed!
ru: На диске недостаточно места для восстановления из резервной копии! Свободно - {0} Требуется не менее - {1} Удалите некоторые копии, чтобы продолжить!

source: Starting restore from backup...
ru: Начинаем восстановление из резервной копии...

source: Done!
ru: Сделано!

source: Select backup:
ru: Выберите резервную копию:

source: {0}, bot already has poll on `backup remove` command!
ru: {0}, у бота уже есть опрос по команде `backup remove`!

source: this man {0} is trying to delete backup with reason `{1}` dated `{2}` made by {3} of `{4}` server. Will you let that happen?
ru: этот человек {0} пытается удалить резервную копию с причиной `{1}` от `{2}` сервера `{4}`, сделанную {3}. Дадите ли вы этому произойти?
