Repository: Druzai/Bot_Mc_discord
Catalog: locales/*/LC_MESSAGES/lang.po
Languages: ru

source: this man {0} is trying to delete backup dated `{1}` made by {2} of `{3}` server. Will you let that happen?
ru: этот человек {0} пытается удалить резервную копию от `{1}` сервера `{3}`, сделанную {2}. Дадите ли вы этому произойти?

source: Deleted backup dated {0} of '{1}' server
ru: Удалена резервная копия от {0} сервера '{1}'

source: Bot doesn't have this language! Check list of available languages via {0}language
ru: У бота нет данного языка! Проверьте лист доступных языков через {0}language

source: Language switched successfully!
ru: Язык успешно сменён!

source: Authorization
ru: Авторизация

source: Auto backup
ru: Авторезервирование

source: White list
ru: Только разрешённые ники

source: Temporary operator
ru: Временный оператор

source: Forceload
ru: Держать загруженным

source: Auto shutdown
ru: Автоотключение

source: Game chat
ru: Игровой чат

source: Image preview
ru: Предпросмотр изображения

source: Obituary
ru: Некролог

source: RSS feed
ru: RSS канал

source: RCON password '{0}' doesn't match with its value in '{1}'!
ru: Пароль rcon '{0}' не совпадает с его значением в '{1}'!

source: Couldn't connect to server. Try again.
ru: Не удалось подключиться к серверу. Попробуйте ещё раз.

source: {0} didn't input the argument '{1}' of type '{2}' in command '{3}'
ru: {0} не ввёл аргумент '{1}' типа '{2}' в команде '{3}'

source: Required argument '{0}' of type '{1}' is missing!
ru: Обязательный аргумент '{0}' типа '{1}' отсутствует!

source: {0} passed too many arguments to command '{1}'
ru: {0} ввёл слишком много аргументов для команды '{1}'

source: You passed too many arguments to this command!
ru: Вы ввели слишком много аргументов для этой команды!

source: {0} passed member mention '{1}' that can't be found
ru: {0} предоставил упоминание участника '{1}', которое не может быть найдено

source: Member '{0}' not found!
ru: Участник '{0}' не был найден!

source: {0} passed user mention '{1}' that can't be found
ru: {0} предоставил упоминание пользователя '{1}', которое не может быть найдено

source: User '{0}' not found!
ru: Пользователь '{0}' не был найден!

source: {0} passed role mention '{1}' that can't be found
ru: {0} предоставил упоминание роли '{1}', которое не может быть найдено

source: Role '{0}' not found!
ru: Роль '{0}' не была найдена!

source: Bot can't read messages in channel '{0}'
ru: Бот не может читать сообщения в канале '{0}'!

source: {0} passed channel mention '{1}' that can't be found
ru: {0} предоставил упоминание канала '{1}', которое не может быть найдено

source: Channel '{0}' not found!
ru: Канал '{0}' не был найден!

source: {0} passed thread mention '{1}' that can't be found
ru: {0} предоставил упоминание ветки '{1}', которое не может быть найдено

source: Thread '{0}' not found!
ru: Ветка '{0}' не была найдена!

source: {0} passed bad bool argument '{1}'
ru: {0} предоставил неправильный булевый аргумент '{1}'

source: Bot couldn't convert bool argument '{0}'!
ru: Бот не смог преобразовать булевый аргумент '{0}'!

source: {0} passed bad literal '{1}'
ru: {0} предоставил неправильный литерал '{1}'

source: Bot couldn't find argument '{0}' in any of these values: {1}!
ru: Бот не смог найти аргумент '{0}' ни в одном из следующих значений: {1}!

source: {0} passed an invalid IPv4 address as argument '{1}'
ru: {0} предоставил недопустимый IPv4-адрес в качестве аргумента '{1}'

source: Bot couldn't convert argument '{0}' to an IPv4 address!
ru: Бот не смог преобразовать аргумент '{0}' в IPv4-адрес!

source: {0} passed an invalid URL as argument '{1}'
ru: {0} предоставил недопустимый URL-адрес в качестве аргумента '{1}'

source: Bot couldn't convert argument '{0}' to a URL!
ru: Бот не смог преобразовать аргумент '{0}' в URL-адрес!

source: {0} passed parameter '{2}' in string "{3}" that bot couldn't convert to type '{1}' in command '{4}'
ru: {0} предоставил параметр '{2}' в строке "{3}", который бот не смог преобразовать к типу '{1}' в команде '{4}'

source: Bot didn't recognized parameter '{1}' Received: '{2}' Expected: value of type '{0}'
ru: Бот не распознал параметр '{1}' Получено: '{2}' Ожидалось: значение типа '{0}'

source: {0} passed string "{1}" that can't be parsed in command '{2}'
ru: {0} предоставил строку "{1}", которая не может быть пропарсена в команде '{2}'

source: Bot couldn't parse user string '{0}' in this command!
ru: Бот не смог пропарсить пользовательскую строку '{0}' в этой команде!

source: Bot doesn't have some permissions
ru: Бот не имеет некоторых прав доступа

source: Bot don't have these permissions to run this command:
ru: Бот не имеет этих прав доступа чтобы использовать эту команду:

source: {0} entered non-existent command
ru: {0} ввёл несуществующую команду

source: You entered non-existent command!
ru: Вы ввели несуществующую команду!

source: {0} entered wrong argument(s) of command '{1}'
ru: {0} неверно ввёл аргумент(ы) команды '{1}'

source: You entered wrong argument(s) of this command!
ru: Вы неверно ввели аргумент(ы) этой команды!

source: {0} entered disabled command
ru: {0} ввёл отключенную команду

source: You entered disabled command!
ru: Вы ввели отключённую команду!

source: {0} entered a command that only works in the guild
ru: {0} ввёл команду, которая работает только в гильдии

source: This command only works on server!
ru: Эта команда работает только на сервере!

source: {0} triggered a command more than {1} time(s) per {2} sec
ru: {0} вызвал команду больше чем {1} раз(а) за {2} сек

source: You triggered this command more than {0} time(s) per {1} sec. Try again in {2} sec...
ru: Вы вызвали эту команду больше чем {0} раз(а) за {1} сек Попробуйте снова через {2} сек...

source: Ignoring exception in command '{0}{1}':
ru: Игнорируем исключение в команде '{0}{1}':

source: {0} don't have role '{1}' to use interaction
ru: {0} не имеет роли '{1}' для использования взаимодействия

source: You don't have role '{0}' to use this interaction!
ru: Вы не имеете роли '{0}' для использования этого взаимодействия!

source: {0} don't have role '{1}' to run command
ru: {0} не имеет роли '{1}' для использования команды

source: You don't have role '{0}' to run this command!
ru: Вы не имеете роли '{0}' для использования этой команды!

source: {0} don't have some permissions to use interaction
ru: {0} не имеет некоторых прав доступа чтобы использовать взаимодействие

source: You don't have these permissions to use this interaction:
ru: Вы не имеете этих прав доступа чтобы использовать это взаимодействие:

source: {0} don't have some permissions to run command
ru: {0} не имеет некоторых прав доступа чтобы использовать команду

source: You don't have these permissions to run this command:
ru: Вы не имеете этих прав доступа чтобы использовать эту команду:

source: This interaction failed! Try again!
ru: Это взаимодействие не удалось! Попробуйте ещё раз!

source: Ignoring exception in view '{0}' created by command '{1}':
ru: Игнорируем исключение в представлении '{0}', созданным командой '{1}':

source: Ignoring exception in view '{0}':
ru: Игнорируем исключение в представлении '{0}':

source: Ignoring exception in internal background task '{0}':
ru: Игнорируем исключение во внутренней фоновой задаче '{0}':

source: Ignoring exception in internal event '{0}':
ru: Игнорируем исключение во внутреннем событии '{0}':

source: Ignoring the SSL error when checking a link for image preview ({0}):
ru: Игнорируем исключение SSL при проверке ссылки для предварительного просмотра изображения ({0}):

source: Ignoring the SSL error when connecting with a link ({0}):
ru: Игнорируем исключение SSL при подключении с помощью ссылки ({0}):

source: this chat can't work! Game chat disabled!
ru: этот чат не может работать! Игровой чат выключен!

source: server is restarting!
ru: сервер перезагружается!

source: No players on server!
ru: На сервере нет игроков!

source: Entity
ru: Сущность

source: Type: {0}
ru: Тип: {0}

source: Player
ru: Игрок

source: Minecraft server is not in release state! Proceed with caution!
ru: Майнкрафт сервер не находится в состоянии релиза! Действуйте с осторожностью!

source: Bot couldn't shorten the URL "{0}" using link shortening services.
ru: Бот не смог сократить url "{0}" с помощью сервисов сокращения ссылок.

source: RSS Warning: Date from bot config is invalid. Bot will use current date for checking...
ru: Предупреждение RSS: Недопустимая дата из конфигурации бота. Бот будет использовать текущую дату для проверки...

source: RSS Warning: URL of RSS feed doesn't set!
ru: Предупреждение RSS: URL-адрес RSS-канала не установлен!

source: RSS webhook
ru: RSS вебхук

source: Watcher Error: File '{0}' wasn't found!
ru: Ошибка наблюдателя: Файл '{0}' не был найден!

source: Watcher Error: Can't decode strings from file '{0}', check that Minecraft server saves it in utf-8 encoding! (Ensure you have '-Dfile.encoding=UTF-8' as one of the arguments to start the server in start script)
ru: Ошибка наблюдателя: Не удается декодировать строки из файла '{0}', проверьте, что майнкрафт сервер сохраняет их в кодировке utf-8! (Убедитесь, что у вас есть '-Dfile.encoding=UTF-8' в качестве одного из аргументов для запуска сервера в стартовом скрипте)

source: Watcher Unhandled Error: {0}
ru: Необработанная ошибка наблюдателя: {0}

source: Game chat webhook
ru: Вебхук для игрового чата

source: Bot Error: Couldn't find channel for game chat!
ru: Ошибка бота: Не удалось найти канал для игрового чата!

source: Intrusion attempt on already logged in nick Your IP: {0}
ru: Попытка вторжения на уже вошедший ник Ваш IP: {0}

source: Too many login attempts Your IP: {0}
ru: Слишком много попыток авторизации Ваш IP: {0}

source: Intrusion prevented: User was banned!
ru: Вторжение предотвращено: Пользователь был забанен!

source: Too many login attempts: User was banned!
ru: Слишком много попыток авторизации: Пользователь был забанен!

source: Nick: {0} IP: {1} Time: {2}
ru: Ник: {0} IP: {1} Время: {2}

source: You don't own this logged in nick
ru: Вы не являетесь владельцем этого зашедшего ника

source: Not authorized Your IP: {0} Code: {1}
ru: Не авторизован Ваш IP: {0} Код: {1}

source: You will be unbanned in {0} sec or after authorization!
ru: Вы будете разбанены через {0} сек или после авторизации!

source: Status:
ru: Статус:

source: Previously used nicknames:
ru: Ранее использовал ники:

source: Connection attempt detected! Nick: {0} IP: {1} {2}Connection attempts: {3} Time: {4}
ru: Попытка подключения зафиксирована! Ник: {0} IP: {1} {2}Попыток подключения: {3} Время: {4}

source: To proceed enter command `{0}` within {1} min
ru: Чтобы продолжить, введите команду `{0}` в течение {1} мин

source: To ban this IP-address enter command `{0}`
ru: Чтобы забанить этот IP-адрес, введите команду `{0}`

source: Login without code? (Less safe)
ru: Войти без кода? (Менее безопасно)

source: ☠ Obituary ☠
ru: ☠ Некролог ☠

source: File '{0}' doesn't exist!
ru: Файл '{0}' не существует!

source: Not allowed
ru: Отказано

source: Session expired
ru: Сессия истекла

source: Access granted
ru: Доступ разрешён

source: Directory {0} doesn't exist!
ru: Директория '{0}' не существует!

source: There are some mismatched backups entries in '{0}':
ru: В '{0}' есть несколько несоответствующих записей резервных копий:

source: Deleted backup entry named '{0}'
ru: Удалена резервная запись с именем '{0}'

source: File '{0}' doesn't exist! Run Minecraft server manually to create one and accept eula!
ru: Файл '{0}' не существует! Запустите майнкрафт сервер вручную, чтобы создать его и примите eula!

source: File '{0}' doesn't have any parameters! Accept eula and run Minecraft server manually to fill it with parameters!
ru: Файл '{0}' не имеет никаких параметров! Примите eula и запустите майнкрафт сервер вручную, чтобы заполнить его параметрами!

source: Note: Bot set property "log-ips" to true because otherwise secure authorization won't work.
ru: Примечание: Бот включил свойство "log-ips", потому что в противном случае безопасная авторизация не будет работать.

source: Reminder: For better security you have to change this password for a more secure one.
ru: Напоминание: Для большей безопасности вам необходимо сменить этот пароль на более безопасный.

source: Note: In '{0}' bot set these parameters:
ru: Примечание: в '{0}' бот установил следующие параметры:

source: Proxy type isn't HTTP or HTTPS. Bot will use webhooks and requests without proxy!
ru: Тип прокси-сервера не является HTTP или HTTPS. Бот будет использовать вебхуки и запросы без прокси-сервера!

source: Your number lower than {0}!
ru: Ваше число меньше чем {0}!

source: Your number higher than {0}!
ru: Ваше число больше чем {0}!

source: Your string doesn't contain an integer!
ru: Ваша строка не содержит целого числа!

source: Your string doesn't contain a fractional number!
ru: Ваша строка не содержит дробного числа!

source: File '{0}' wasn't found! Setting up a new one!
ru: Файл '{0}' не найден! Настраиваем новый!

source: File '{0}' was found!
ru: Файл '{0}' был найден!

source: Config saved!
ru: Конфиг сохранён!

source: Config read!
ru: Конфиг прочитан!

source: Language setting in bot config is wrong! Setting up language again...
ru: Неправильная установка языка в конфиге бота! Настраиваем язык снова...

source: Bot selected language based on your system language.
ru: Бот выбрал русский основываясь на вашем системном языке.

source: Do you want to change it?
ru: Вы хотите поменять его?

source: Enter one of these two-letter language codes:
ru: Введите один из этих двухбуквенных языковых кодов:

source: This language selected!
ru: Русский язык выбран!

source: Bot doesn't have such language. Try again.
ru: У бота нет такого языка. Попробуйте снова.

source: Bot couldn't decrypt Discord token with key from file '{0}'!
ru: Бот не смог расшифровать токен дискорда с ключом из файла '{0}'!

source: Discord token not founded. Enter it
ru: Токен дискорда не найден. Введите его

source: Enable using proxy?
ru: Включить использование прокси-сервера?

source: Enter proxy URL (Example - http://{ip_address}:{port})
ru: Введите URL-адрес прокси-сервера (пример - http://{ip_address}:{port})

source: Enable using proxy credentials?
ru: Включить использование учетных данных прокси-сервера?

source: Enter proxy login
ru: Введите логин прокси-сервера

source: Enter proxy password
ru: Введите пароль прокси-сервера

source: Enable using proxy for RSS?
ru: Включить использование прокси-сервера для RSS?

source: Enable using proxy for other requests? (Such as checking links/images from channel associated with game chat feature, checking Minecraft snapshot version, getting shortened links and etc.)
ru: Разрешить использование прокси-сервера для других запросов? (Например, проверка ссылок/изображений с канала, связанного с функцией игрового чата, проверка версии снапшота майнкрафта, получение сокращенных ссылок и т.д.)

source: Bot using proxy URL '{0}'.
ru: Бот использует URL-адрес прокси-сервера '{0}'.

source: Proxy: login '{0}', password '{1}'.
ru: Прокси-сервер: логин '{0}', пароль '{1}'.

source: Bot isn't using any proxy.
ru: Бот не использует никакого прокси-сервера.

source: Enter bot prefix
ru: Введите префикс бота

source: Bot prefix set to '{0}'.
ru: Префикс бота - '{0}'.

source: Default help arguments for each command are {0}.
ru: Аргументы справки по умолчанию для каждой команды - {0}.

source: Would you like to add something else?
ru: Хотите добавить какие-то ещё?

source: Enter new arguments comma separated
ru: Введите новые аргументы через запятую

source: Arguments added!
ru: Аргументы добавлены!

source: Help arguments for each command set to {0}.
ru: Аргументы справки для каждой команды - {0}.

source: Role for commands that manage Minecraft server is set.
ru: Роль для команд, которые управляют майнкрафт сервером, указана.

source: Role for commands that manage Minecraft server doesn't stated. You can set it via command {0}.
ru: Роль для команд, которые управляют майнкрафт сервером, не указана. Вы можете установить её с помощью команды {0}.

source: Admin role for bot is set.
ru: Роль админа для бота установлена.

source: Admin role for bot doesn't stated. You can set it via command {0}. Bot will check if member has 'Administrator' permission.
ru: Роль админа для бота не указана. Вы можете установить её с помощью команды {0}. Бот будет проверять, есть ли у участника право доступа 'Администратор'.

source: Enter server's real IP-address or DNS-name
ru: Введите реальный IP-адрес или DNS-имя сервера

source: Server's real IP-address or DNS-name is '{0}'.
ru: Реальный IP-адрес или DNS-имя сервера - '{0}'.

source: Enter server's local address (default - 'localhost')
ru: Введите локальный адрес сервера (по умолчанию - 'localhost')

source: Do you want bot to log messages to '{0}' file?
ru: Вы хотите, чтобы бот логировал сообщения в файл '{0}'?

source: Set limit for deletion messages without poll (0 - for disable poll) (int)
ru: Установите предел на удаление сообщений без опроса (0 - для отключения опроса) (целое число)

source: Server menu message id not found. Would you like to enter it?
ru: Id сообщения меню сервера не найден. Вы хотите его ввести?

source: Enter server menu message id
ru: Введите id сообщения меню сервера

source: Server menu via buttons won't work. To make it work type '{0}menu server' to create new server menu and its message id with channel id.
ru: Меню сервера через кнопки не будет работать. Чтобы оно заработало, введите '{0}menu server' для создания нового меню сервера и его id сообщения с id канала.

source: Server menu channel id not found. Would you like to enter it?
ru: Id канала меню сервера не найден. Вы хотите его ввести?

source: Enter server menu channel id
ru: Введите id канала меню сервера

source: Bot will try to find channel and message by going through all channels in Discord server.
ru: Бот попытается найти канал и сообщение, перебрав все каналы на сервере дискорда.

source: Do you want the bot to never ask you about server menu setup?
ru: Вы хотите, чтобы бот никогда не спрашивал вас о настройке меню сервера?

source: Bot menu message id not found. Would you like to enter it?
ru: Id сообщения меню бота не найден. Вы хотите его ввести?

source: Enter bot menu message id
ru: Введите id сообщения меню бота

source: Bot menu via buttons won't work. To make it work type '{0}menu bot' to create new bot menu and its message id with channel id.
ru: Меню бота через кнопки не будет работать. Чтобы оно заработало, введите '{0}menu bot' для создания нового меню бота и его id сообщения с id канала.

source: Bot menu channel id not found. Would you like to enter it?
ru: Id канала меню бота не найден. Вы хотите его ввести?

source: Enter bot menu channel id
ru: Введите id канала меню бота

source: Do you want the bot to never ask you about bot menu setup?
ru: Вы хотите, чтобы бот никогда не спрашивал вас о настройке меню бота?

source: Commands' channel id not found. Would you like to enter it?
ru: Id канала команд не найден. Вы хотите его ввести?

source: Enter commands' channel id
ru: Введите id канала команд

source: Bot will send some push events to the channel it can post to. To make it work right type '{0}channel commands' to create a link.
ru: Бот будет отправлять некоторые push-события в канал, в котором он может опубликовать. Чтобы заставить его работать правильно, введите '{0}channel commands' для создания ссылки.

source: Set gaming status
ru: Установите игровой статус

source: Set idle status
ru: Введите статус в состоянии ожидания

source: Set default number of times to give an operator for every player (int):
ru: Установите количество раз по умолчанию на получение оператора для каждого игрока (целое число):

source: Timeout between check-ups 'Server on/off' set below 5. Change this option.
ru: Время ожидания между проверками 'Сервер включён/выключен' установлено ниже 5. Измените этот параметр.

source: Note: If your machine has processor with frequency 2-2.5 GHz, you have to set this option at least to '8' seconds or higher for the bot to work properly.
ru: Примечание: Если на вашем компьютере установлен процессор с частотой 2–2,5 ГГц, для правильной работы бота необходимо установить для этого параметра как минимум значение '8' секунд или больше.

source: Set timeout between check-ups 'Server on/off' (in seconds, int)
ru: Установите время ожидания между проверками 'Сервер включён/выключен' (в секундах, целое число)

source: Timeout between check-ups 'Server on/off' set to {0} sec.
ru: Время ожидания между проверками 'Сервер включён/выключен' установлено на {0} сек.

source: Timeout for shutdown the Minecraft server when no players found during a long period of time set below 0. Change this option.
ru: Время ожидания для отключения майнкрафт сервера, когда в течение длительного периода времени не было обнаружено ни одного игрока установлено ниже 0. Измените этот параметр.

source: Set timeout for shutdown the Minecraft server when no players found during a long period of time (0 - for instant shutdown) (in seconds, int)
ru: Установите время ожидания для отключения майнкрафт сервера, когда в течение длительного периода времени не было обнаружено ни одного игрока (0 - для мгновенного отключения) (в секундах, целое число)

source: Timeout for shutdown the Minecraft server when no players found during a long period of time set to {0} sec.
ru: Время ожидания для отключения майнкрафт сервера, когда в течение длительного периода времени не было обнаружено ни одного игрока установлено на {0} сек.

source: Timeout for being operator in Minecraft set below 0. Change this option.
ru: Время ожидания для оператора в майнкрафте установлено ниже 0. Измените этот параметр.

source: Set timeout for being operator in Minecraft (0 - for unlimited timeout) (in seconds, int)
ru: Установите время ожидания для оператора в майнкрафте (0 - для неограниченного времени ожидания) (в секундах, целое число)

source: Timeout while bot pinging server for info set below 0. Change this option.
ru: Время ожидания, пока бот пингует сервер для получения информации, установлено ниже 0. Измените этот параметр.

source: Set timeout while bot pinging server for info (in seconds, float)
ru: Установите время ожидания, пока бот пингует сервер для получения информации (в секундах, целое число)

source: Timeout while bot pinging server for info set to {0} sec.
ru: Время ожидания, пока бот пингует сервер для получения информации, установлено на {0} сек.

source: Timeout before message deletion is set below 1. Change this option.
ru: Время ожидания перед удалением сообщения установлено ниже 1. Измените этот параметр.

source: Set timeout before message deletion (in seconds, int)
ru: Установите время ожидания перед удалением сообщения (в секундах, целое число)

source: Timeout before message deletion is set to {0} sec.
ru: Время ожидания перед удалением сообщения установлено на {0} сек.

source: Selected Minecraft server number is out of range! Bot set it to '1'.
ru: Выбранный номер майнкрафт сервера вне допустимого диапазона! Бот установил его на '1'.

source: Selected Minecraft server dir set to path '{0}' also known as '{1}'.
ru: Выбранная директория майнкрафт сервера установлена на путь '{0}', также известная как '{1}'.

source: There is/are {0} server(s) in bot config
ru: В конфиге бота {0} сервер(ов)

source: How much servers you intend to keep?
ru: Сколько серверов вы собираетесь держать?

source: Would you like to delete this server '{0}'?
ru: Вы хотите удалить этот сервер '{0}'?

source: Would you like to change this server '{0}'?
ru: Хотите изменить этот сервер "{0}"?

source: Configuring new server settings...
ru: Настраиваем новые параметры для сервера...

source: Enter server name
ru: Введите название сервера
